{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "5c804d55",
   "metadata": {},
   "outputs": [],
   "source": [
    "from graph.graph_builder import FolktaleGraphBuilder\n",
    "from utils.loader import load_json\n",
    "from schemas.folktale import Folktale\n",
    "from graph.neo4j_manager import Neo4jManager\n",
    "from tqdm import tqdm\n",
    "import os\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "cb754f5f",
   "metadata": {},
   "outputs": [],
   "source": [
    "out_dir = \"./out2\"\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "126a47e2",
   "metadata": {},
   "outputs": [],
   "source": [
    "folktales = []\n",
    "for file in os.listdir(out_dir):\n",
    "\tpath = os.path.join(out_dir, file)\n",
    "\tfolktale = load_json(path)\n",
    "\tfolktales.append(Folktale(**folktale))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "5f03a7de",
   "metadata": {},
   "outputs": [],
   "source": [
    "neo4j = Neo4jManager()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "0b526b0d",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph_builder = FolktaleGraphBuilder(neo4j)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "0a32e011",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph_builder.clear_database()\n",
    "graph_builder.setup()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "69396d34",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████| 5/5 [00:11<00:00,  2.34s/it]\n"
     ]
    }
   ],
   "source": [
    "for folktale in tqdm(folktales):\n",
    "\tgraph_builder.add_folktale(folktale)\n",
    "\t"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "8fa75957",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N00', status_description='warn: feature deprecated. CALL subquery without a variable scope clause is deprecated. Use CALL () { ... }', position=<SummaryInputPosition line=2, column=9, offset=9>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 9, 'line': 2, 'column': 9}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: \"\\n        CALL {\\n            MATCH (o:Object)\\n            WHERE NOT EXISTS {\\n                MATCH (o)<-[:HAS_OBJECT]-(:Event)\\n            }\\n            RETURN 'Object' AS type, o.id AS id, o.name AS name,\\n                'No event link' AS reason, o AS node\\n\\n            UNION ALL\\n\\n            MATCH (a:Agent)\\n            WHERE NOT EXISTS {\\n                MATCH (a)<-[:HAS_AGENT]-(:Event)\\n            }\\n            RETURN 'Agent' AS type, a.id AS id, a.name AS name,\\n                'No event participation' AS reason, a AS node\\n\\n            UNION ALL\\n\\n            MATCH (p:Place)\\n            WHERE NOT EXISTS {\\n                MATCH (p)<-[:TAKES_PLACE_IN]-(:Event)\\n            }\\n            AND NOT EXISTS {\\n                MATCH (p)<-[:LIVES_IN]-(:Agent)\\n            }\\n            RETURN 'Place' AS type, p.id AS id, p.name AS name,\\n                'No event usage and unlinked' AS reason, p AS node\\n        }\\n        RETURN type, id, name, reason\\n        \"\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[{'type': 'Object',\n",
       "  'id': 'object_ac7ad96421b24657826fb77e4e46d923',\n",
       "  'name': 'horse',\n",
       "  'reason': 'No event link'},\n",
       " {'type': 'Place',\n",
       "  'id': 'place_8310f53cfbf546e0a8c35ae5bfd452f7',\n",
       "  'name': 'The Village',\n",
       "  'reason': 'No event usage and unlinked'},\n",
       " {'type': 'Place',\n",
       "  'id': 'place_f7617767a55c4e34ad87e88cffb7e912',\n",
       "  'name': 'The Farm Ground',\n",
       "  'reason': 'No event usage and unlinked'}]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph_builder.find_loose_entities()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "24a9ebea",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N00', status_description='warn: feature deprecated. CALL subquery without a variable scope clause is deprecated. Use CALL () { ... }', position=<SummaryInputPosition line=2, column=9, offset=9>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 9, 'line': 2, 'column': 9}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: \"\\n        CALL {\\n            MATCH (o:Object)\\n            WHERE NOT EXISTS { MATCH (o)<-[:HAS_OBJECT]-(:Event) }\\n            WITH collect(DISTINCT o) AS nodes\\n            WITH nodes, [n IN nodes | n.name] AS names\\n            UNWIND nodes AS o\\n            DETACH DELETE o\\n            RETURN 'Object' AS type, names\\n\\n            UNION ALL\\n\\n            MATCH (a:Agent)\\n            WHERE NOT EXISTS { MATCH (a)<-[:HAS_AGENT]-(:Event) }\\n            WITH collect(DISTINCT a) AS nodes\\n            WITH nodes, [n IN nodes | n.name] AS names\\n            UNWIND nodes AS a\\n            DETACH DELETE a\\n            RETURN 'Agent' AS type, names\\n\\n            UNION ALL\\n\\n            MATCH (p:Place)\\n            WHERE NOT EXISTS { MATCH (p)<-[:TAKES_PLACE_IN]-(:Event) }\\n            AND NOT EXISTS { MATCH (p)<-[:LIVES_IN]-(:Agent) }\\n            WITH collect(DISTINCT p) AS nodes\\n            WITH nodes, [n IN nodes | n.name] AS names\\n            UNWIND nodes AS p\\n            DETACH DELETE p\\n            RETURN 'Place' AS type, names\\n        }\\n        RETURN type, names\\n        \"\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[{'type': 'Object', 'names': ['horse']},\n",
       " {'type': 'Place', 'names': ['The Village', 'The Farm Ground']},\n",
       " {'type': 'Place', 'names': ['The Village', 'The Farm Ground']}]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph_builder.delete_loose_entities()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "66ec0f92",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N00', status_description='warn: feature deprecated. CALL subquery without a variable scope clause is deprecated. Use CALL () { ... }', position=<SummaryInputPosition line=2, column=9, offset=9>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 9, 'line': 2, 'column': 9}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: \"\\n        CALL {\\n            MATCH (o:Object)\\n            WHERE NOT EXISTS {\\n                MATCH (o)<-[:HAS_OBJECT]-(:Event)\\n            }\\n            RETURN 'Object' AS type, o.id AS id, o.name AS name,\\n                'No event link' AS reason, o AS node\\n\\n            UNION ALL\\n\\n            MATCH (a:Agent)\\n            WHERE NOT EXISTS {\\n                MATCH (a)<-[:HAS_AGENT]-(:Event)\\n            }\\n            RETURN 'Agent' AS type, a.id AS id, a.name AS name,\\n                'No event participation' AS reason, a AS node\\n\\n            UNION ALL\\n\\n            MATCH (p:Place)\\n            WHERE NOT EXISTS {\\n                MATCH (p)<-[:TAKES_PLACE_IN]-(:Event)\\n            }\\n            AND NOT EXISTS {\\n                MATCH (p)<-[:LIVES_IN]-(:Agent)\\n            }\\n            RETURN 'Place' AS type, p.id AS id, p.name AS name,\\n                'No event usage and unlinked' AS reason, p AS node\\n        }\\n        RETURN type, id, name, reason\\n        \"\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph_builder.find_loose_entities()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "29a0e0dd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "El índice vectorial 'event_embeddings' ya existe. Saltando.\n",
      "El índice vectorial 'agent_embeddings' ya existe. Saltando.\n",
      "El índice vectorial 'place_embeddings' ya existe. Saltando.\n",
      "El índice vectorial 'object_embeddings' ya existe. Saltando.\n"
     ]
    }
   ],
   "source": [
    "graph_builder.create_vector_databases()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "7a78c3fa",
   "metadata": {},
   "outputs": [],
   "source": [
    "neo4j.close()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7ec90f23",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "folktales-graph-rag",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
