{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "4cef4733",
   "metadata": {},
   "outputs": [],
   "source": [
    "from retrievers.vector_retriever import VectorRetriever\n",
    "from retrievers.fulltext_retriever import FullTextRetriever\n",
    "from retrievers.hybrid_retriever import HybridRetriever\n",
    "from retrievers.text2cypher import Text2CypherRetriever\n",
    "from graph.neo4j_manager import Neo4jManager\n",
    "from agents.multi_agent_system import MultiAgentSystem\n",
    "from agents.question_descomposer import QuestionDecomposer\n",
    "import pandas as pd\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "01e0cf9f",
   "metadata": {},
   "outputs": [],
   "source": [
    "neo4j = Neo4jManager()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "2253c4ca",
   "metadata": {},
   "outputs": [],
   "source": [
    "dec = QuestionDecomposer()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "2bcc5c8f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'ground_truth': \"Character: monkey\\nDescription: The monkey is a companion of Momotaro. He goes to the Ogres' Island with him.\\n\\nOR\\n\\nCharacter: pheasant\\nDescription: The pheasant is a companion of Momotaro. He flies over the castle gate to peck the Ogres.\\n\\nOR\\n\\nCharacter: dog\\nDescription: The dog is a companion of Momotaro. He breaks the bolts and bars with him.\\n\\nOR\\n\\nCharacter: crow\\nDescription: A clever and resourceful bird who helps the bird catcher in his tasks and becomes a trusted advisor to the emperor.\"}]\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:Character)-[:HAS_ROLE]->(r:Role) WHERE toLower(r.name) CONTAINS \"helper\" WITH collect('Character: ' + a.name + '\\nDescription: ' + a.description) AS characters RETURN reduce(result = '', c IN characters | result + CASE WHEN result = '' THEN '' ELSE '\\n\\nOR\\n\\n' END + c) AS ground_truth\n",
    "\"\"\"\n",
    "\n",
    "results = neo4j.execute_query(query)\n",
    "\n",
    "print(results)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "8d4a3220",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Benchmark CSV: 36 preguntas\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>question</th>\n",
       "      <th>cypher</th>\n",
       "      <th>type</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Hello</td>\n",
       "      <td>RETURN \"Hello! I'm a knowledge assistant focus...</td>\n",
       "      <td>greeting</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>What can you do?</td>\n",
       "      <td>RETURN \"I can answer questions about folktales...</td>\n",
       "      <td>greeting</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>How is the weather today?</td>\n",
       "      <td>RETURN \"This question is outside my scope.\" AS...</td>\n",
       "      <td>out_of_scope</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Who won the last football World Cup?</td>\n",
       "      <td>RETURN \"This question is outside my scope.\" AS...</td>\n",
       "      <td>out_of_scope</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>What is the capital of France?</td>\n",
       "      <td>RETURN 'This question is outside my scope.' AS...</td>\n",
       "      <td>out_of_scope</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                               question  \\\n",
       "0                                 Hello   \n",
       "1                      What can you do?   \n",
       "2             How is the weather today?   \n",
       "3  Who won the last football World Cup?   \n",
       "4        What is the capital of France?   \n",
       "\n",
       "                                              cypher          type  \n",
       "0  RETURN \"Hello! I'm a knowledge assistant focus...      greeting  \n",
       "1  RETURN \"I can answer questions about folktales...      greeting  \n",
       "2  RETURN \"This question is outside my scope.\" AS...  out_of_scope  \n",
       "3  RETURN \"This question is outside my scope.\" AS...  out_of_scope  \n",
       "4  RETURN 'This question is outside my scope.' AS...  out_of_scope  "
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dataset = pd.read_csv('./data/benchmark_data.csv', delimiter=\";\")\n",
    "print(f\"Benchmark CSV: {len(dataset)} preguntas\")\n",
    "dataset.head()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "aa97a913",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Hello: ['Hello']\n",
      "What can you do?: ['What can you do?']\n",
      "How is the weather today?: ['How is the weather today?']\n",
      "Who won the last football World Cup?: ['Who won the last football World Cup?']\n",
      "What is the capital of France?: ['What is the capital of France?']\n",
      "Which movies did Momotaro appear in?: ['Which movies did Momotaro appear in?']\n",
      "What is Momotaro's surname?: [\"What is Momotaro's surname?\"]\n",
      "Hold old is Momotaro?: ['Hold old is Momotaro?']\n",
      "What is the town population in 'Sharing Joy and Sorrow'?: [\"What is the town population in 'Sharing Joy and Sorrow'?\"]\n",
      "List all Genre nodes in the graph: ['List all Genre nodes in the graph']\n",
      "How many Folktale nodes are in the graph?: ['How many Folktale nodes are in the graph?']\n",
      "How many Event nodes are in the graph?: ['How many Event nodes are in the graph?']\n",
      "How many Character nodes are in the graph?: ['How many Character nodes are in the graph?']\n",
      "How many Place nodes are in the graph?: ['How many Place nodes are in the graph?']\n",
      "How many Object nodes are in the graph?: ['How many Object nodes are in the graph?']\n",
      "How many typed relationships are in the graph?: ['How many typed relationships are in the graph?']\n",
      "What is the nationality of the folktale 'The Birdcatcher'?: [\"What is the nationality of the folktale 'The Birdcatcher'?\"]\n",
      "Where do the ogres live?: ['Where do the ogres live?']\n",
      "What race is Momotaro?: ['What race is Momotaro?']\n",
      "What type of place is Constantinople?: ['What type of place is Constantinople?']\n",
      "Who is the tailor's wife from 'Sharing Joy and Sorrow'?: [\"Who is the tailor's wife from 'Sharing Joy and Sorrow'?\"]\n",
      "What is the description of The Magistrates' Court?: [\"What is the description of The Magistrates' Court?\"]\n",
      "What genre is 'Momotaro' folktale?: [\"What genre is 'Momotaro' folktale?\"]\n",
      "What is the gender of the birdcatcher?: ['What is the gender of the birdcatcher?']\n",
      "How did Momotaro convince the animals to join him on his journey?: ['How did Momotaro convince the animals to join him on his journey?']\n",
      "What is Momotaro's Role?: [\"What is Momotaro's Role?\"]\n",
      "List all the events in the folktale 'The Thieves and the Cock': [\"List all the events in the folktale 'The Thieves and the Cock'\"]\n",
      "What Event nodes take place in Constantinople?: ['What Event nodes take place in Constantinople?']\n",
      "Who are Momotaro's friends?: [\"Who are Momotaro's friends?\"]\n",
      "Which characters appear in 'The Thieves and the Cock'?: [\"Which characters appear in 'The Thieves and the Cock'?\"]\n",
      "What are the personality traits of the tiger character?: ['What are the personality traits of the tiger character?']\n",
      "Give me the first 3 events of 'How the Tiger Got Its Stripes.': [\"Give me the first 3 events of 'How the Tiger Got Its Stripes.'\"]\n",
      "What happened to Momotaro and his companions when they were in The Ogres' Island castle?: [\"What happened to Momotaro and his companions when they were in The Ogres' Island castle?\"]\n",
      "What happened after the tailor was put in prison?: ['What happened after the tailor was put in prison?']\n",
      "Which are the 3 most important characters based on the number of events they appear in?: ['Find all unique characters and their corresponding event counts.', 'Rank these characters by their event count in descending order.']\n",
      "Give me a character who is a helper and then describe them.: ['Get all characters in the folktale', 'Filter the result to get only helpers']\n"
     ]
    }
   ],
   "source": [
    "for i, row in dataset.iterrows():\n",
    "\tquestion = row[\"question\"]\n",
    "\n",
    "\tsubquestions = dec.run(question)\t\n",
    "\tprint(f\"{question}: {subquestions}\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "fad0c7b8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Hello: [{'ground_truth': \"Hello! I'm a knowledge assistant focused on folktales from all around the world. You can ask me about their characters, relationships, themes or how they are structured.\"}]\n",
      "What can you do?: [{'ground_truth': 'I can answer questions about folktales: their narrative structure, the characters that make them up and their features, the relevant places and objects that appear, among others.'}]\n",
      "How is the weather today?: [{'ground_truth': 'This question is outside my scope.'}]\n",
      "Who won the last football World Cup?: [{'ground_truth': 'This question is outside my scope.'}]\n",
      "What is the capital of France?: [{'ground_truth': 'This question is outside my scope.'}]\n",
      "Which movies did Momotaro appear in?: [{'ground_truth': 'This question is outside my scope.'}]\n",
      "What is Momotaro's surname?: [{'ground_truth': 'This information is not in the knowledge base.'}]\n",
      "Hold old is Momotaro?: [{'ground_truth': 'This information is not in the knowledge base.'}]\n",
      "What is the town population in 'Sharing Joy and Sorrow'?: [{'ground_truth': 'This information is not in the knowledge base.'}]\n",
      "List all Genre nodes in the graph: [{'ground_truth': 'fable'}, {'ground_truth': 'fairy_tale'}, {'ground_truth': 'legend'}, {'ground_truth': 'myth'}]\n",
      "How many Folktale nodes are in the graph?: [{'ground_truth': '5 folktale(s)'}]\n",
      "How many Event nodes are in the graph?: [{'ground_truth': '95 event(s)'}]\n",
      "How many Character nodes are in the graph?: [{'ground_truth': '24 character(s)'}]\n",
      "How many Place nodes are in the graph?: [{'ground_truth': '18 place(s)'}]\n",
      "How many Object nodes are in the graph?: [{'ground_truth': '12 place(s)'}]\n",
      "How many typed relationships are in the graph?: [{'relationship_type_count': 14}]\n",
      "What is the nationality of the folktale 'The Birdcatcher'?: [{'ground_truth': 'serbian'}]\n",
      "Where do the ogres live?: [{'ground_truth': \"the Ogres' Island castle\"}]\n",
      "What race is Momotaro?: [{'ground_truth': 'human'}]\n",
      "What type of place is Constantinople?: [{'ground_truth': 'city'}]\n",
      "Who is the tailor's wife from 'Sharing Joy and Sorrow'?: [{'ground_truth': 'A good, industrious, and pious wife who is abused by her husband.'}]\n",
      "What is the description of The Magistrates' Court?: [{'ground_truth': 'A building used for public services, where the magistrates held court.'}]\n",
      "What genre is 'Momotaro' folktale?: [{'ground_truth': 'fairy_tale'}]\n",
      "What is the gender of the birdcatcher?: [{'ground_truth': 'male'}]\n",
      "How did Momotaro convince the animals to join him on his journey?: [{'ground_truth': 'Momotaro convinced the animals by sharing his kibidango (millet dumplings) with them.'}]\n",
      "What is Momotaro's Role?: [{'ground_truth': 'main_character'}]\n",
      "List all the events in the folktale 'The Thieves and the Cock': [{'ground_truth': 'Cock Pleads for Mercy'}, {'ground_truth': \"Thief Wrings Cock's Neck\"}, {'ground_truth': 'Thief throws Cock into pot.'}, {'ground_truth': 'Thieves steal a Cock.'}]\n",
      "What Event nodes take place in Constantinople?: [{'ground_truth': 'The Birdcatcher Lives'}, {'ground_truth': 'Sultana Asks Birdcatcher Favor'}]\n",
      "Who are Momotaro's friends?: []\n",
      "Which characters appear in 'The Thieves and the Cock'?: [{'ground_truth': 'Thief'}, {'ground_truth': 'Cock'}]\n",
      "What are the personality traits of the tiger character?: [{'ground_truth': 'extraversion (0.8)'}, {'ground_truth': 'conscientiousness (0.6)'}, {'ground_truth': 'conscientiousness (0.6)'}, {'ground_truth': 'neuroticism (0.5)'}, {'ground_truth': 'neuroticism (0.5)'}]\n",
      "Give me the first 3 events of 'How the Tiger Got Its Stripes.': [{'ground_truth': 'Tiger Seeks Farm Worker'}, {'ground_truth': 'Tiger Offers Work Reward'}, {'ground_truth': 'Tiger Rejects Monkey Worker'}]\n",
      "What happened to Momotaro and his companions when they were in The Ogres' Island castle?: [{'ground_truth': 'But the old man never got a taste of the peach. And why did he not?All of a sudden the peach burst in two and there was no stone to it, but a fine boy baby where the stone should have been.“Mercy me!” says the old woman.“Mercy me!” says the old man.'}, {'ground_truth': '“Why,” says Momotaro, “I’m going on a journey, or as you may say, an adventure, and I shall be needing the kimi-dango on the way.”“Where are you going, Momotaro?” says his mother.“I’m off to the Ogres’ Island,” says Momotaro, “to get their treasure, and I should be obliged if you’d let me have the kimi-dango as soon as may be,” he says.'}, {'ground_truth': 'He hadn’t gone far when he fell in with a monkey.“Kia! Kia!” says the monkey. “Where are you off to, Momotaro?”Says Momotaro, “I’m off to the Ogres’ Island for an adventure.”'}, {'ground_truth': 'They hadn’t gone far when they fell in with a dog.“Bow! Wow! Wow!” says the dog. “Where are you off to, Momotaro?”Says Momotaro, “I’m off to the Ogres’ Island.”“What have you got in your wallet, Momotaro?”'}, {'ground_truth': 'By-and-by they came to the Ogres’ Island.“Now, brothers,” says Momotaro, “listen to my plan. The pheasant must fly over the castle gate and peck the Ogres. The monkey must climb over the castle wall and pinch the Ogres. The dog and I will break the bolts and bars.'}, {'ground_truth': 'He will bite the Ogres, and I will fight the Ogres.”Then there was the great battle.Japanese Fairy tale Series, 1 of 16. Griffiin, Farran and Co. Unknown author and illustrator. Published around the 1890’s.The pheasant flew over the castle gate: “Ken! Ken! Ken!”'}, {'ground_truth': 'Those that were left alive they took prisoners and bound with cords—a wicked lot they were.“Now, brothers,” says Momotaro, “bring out the Ogres’ treasure.”So they did.The treasure was worth having, indeed.'}, {'ground_truth': '“Kia! Kia!” says the monkey. “Thanks, my Lord Momotaro.”“Ken! Ken!” says the pheasant. “Thanks, my Lord Momotaro.”“Bow! Wow! Wow!” says the dog. “Thanks, my dear Lord Momotaro.”'}]\n",
      "What happened after the tailor was put in prison?: [{'ground_truth': 'All went on well for a time, but then tailor fell into his old ways, and was surly and quarrelsome. And because tailor dared not beat her, he would seize her by the hair and tear it out. The woman escaped from him, and sprang out into the yard, but he ran after her with his yard-measure and scissors, and chased her about, and threw the yard-measure and scissors at her, and whatever else came his way.'}]\n",
      "Which are the 3 most important characters based on the number of events they appear in?: [{'ground_truth': 'rabbit', 'event_count': 30}, {'ground_truth': 'tiger', 'event_count': 24}, {'ground_truth': 'birdcatcher', 'event_count': 21}]\n",
      "Give me a character who is a helper and then describe them.: [{'ground_truth': \"Character: monkey\\nDescription: The monkey is a companion of Momotaro. He goes to the Ogres' Island with him.\\n\\nOR\\n\\nCharacter: pheasant\\nDescription: The pheasant is a companion of Momotaro. He flies over the castle gate to peck the Ogres.\\n\\nOR\\n\\nCharacter: dog\\nDescription: The dog is a companion of Momotaro. He breaks the bolts and bars with him.\\n\\nOR\\n\\nCharacter: crow\\nDescription: A clever and resourceful bird who helps the bird catcher in his tasks and becomes a trusted advisor to the emperor.\"}]\n"
     ]
    }
   ],
   "source": [
    "for i, row in dataset.iterrows():\n",
    "\tquestion = row[\"question\"]\n",
    "\tcypher = row[\"cypher\"]\n",
    "\t\n",
    "\tresult = neo4j.execute_query(cypher)\n",
    "\tprint(f\"{question}: {result}\")\n",
    "\t"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "646f94d5",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. db.index.vector.queryNodes is deprecated. It is replaced by SEARCH.', position=<SummaryInputPosition line=2, column=9, offset=9>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 9, 'line': 2, 'column': 9}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        CALL db.index.vector.queryNodes($index_name, $top_k, $query_embedding)\\n        YIELD node, score\\n\\n        \\nOPTIONAL MATCH (node)-[:HAS_ROLE]->(r:Role)\\n\\n\\n        RETURN node.name AS name, node.description AS description, r.name AS role, score\\n        ORDER BY score DESC\\n        '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Vector search - 2 resultados\n",
      "\n",
      "1. score=0.866\n",
      "\tMomotaro [main_character]: Momotaro is the son of the old couple. He goes on a journey to get treasure from the Ogres' Island.\n",
      "\n",
      "2. score=0.831\n",
      "\tdog [helper]: The dog is a companion of Momotaro. He breaks the bolts and bars with him.\n",
      "\n"
     ]
    }
   ],
   "source": [
    "query = \"Who is Momotaro?\"\n",
    "\n",
    "extra_match = \"\"\"\n",
    "OPTIONAL MATCH (node)-[:HAS_ROLE]->(r:Role)\n",
    "\"\"\"\n",
    "\n",
    "return_projection={\n",
    "\t\"name\": \"node.name\",\n",
    "\t\"description\": \"node.description\",\n",
    "\t\"role\": \"r.name\"\n",
    "}\n",
    "retriever = VectorRetriever(neo4j, \"character_embeddings\", return_projection, extra_match)\n",
    "results = retriever.retrieve(query)\n",
    "\n",
    "print(f\"Vector search - {len(results)} resultados\\n\")\n",
    "for i, r in enumerate(results, 1):\n",
    "    print(f\"{i}. score={r[\"score\"]:.3f}\")\n",
    "    print(f\"\\t{r[\"name\"]} [{r[\"role\"]}]: {r[\"description\"]}\\n\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "30a85b7b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Fulltext search - 2 resultados\n",
      "\n",
      "1. score=3.452\n",
      "\tMomotaro gives dog a dumpling.: “I’ve got some of the best millet dumplings in all Japan.”“Give me one,” says the dog, “and I will go with you.”So Momotaro gave a millet dumpling to the dog, and the four of them jogged on together.\n",
      "\n",
      "2. score=3.452\n",
      "\tMomotaro Acquires Pheasant Ally: “I’ve got some of the best millet dumplings in all Japan.”“Give me one,” says the pheasant, “and I will go with you.”So Momotaro gave a millet dumpling to the pheasant, and the three of them jogged on together.\n",
      "\n"
     ]
    }
   ],
   "source": [
    "query = \"millet dumpling\"\n",
    "return_fields = {\n",
    "    \"description\": \"node.description\",\n",
    "    \"name\": \"node.name\"\n",
    "}\n",
    "retriever = FullTextRetriever(neo4j, \"event_fulltext\", \"Event\", \"description\", return_fields)\n",
    "results = retriever.retrieve(query)\n",
    "\n",
    "print(f\"Fulltext search - {len(results)} resultados\\n\")\n",
    "for i, r in enumerate(results, 1):\n",
    "    print(f\"{i}. score={r[\"score\"]:.3f}\")\n",
    "    print(f\"\\t{r[\"name\"]}: {r[\"description\"]}\\n\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "61ba0d01",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. db.index.vector.queryNodes is deprecated. It is replaced by SEARCH.', position=<SummaryInputPosition line=4, column=13, offset=60>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 60, 'line': 4, 'column': 13}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        CALL () {\\n            // Vector search\\n            CALL db.index.vector.queryNodes($vector_index, $top_k, $query_embedding)\\n            YIELD node, score\\n            \\n            WITH collect({node: node, score: score}) AS nodes, max(score) AS maxScore, min(score) AS minScore\\n            UNWIND nodes AS n\\n            RETURN n.node AS node,\\n                CASE\\n                    WHEN maxScore = minScore THEN 1.0\\n                    ELSE (n.score - minScore) / (maxScore - minScore)\\n                END * $vector_weight AS score\\n\\n            UNION ALL\\n\\n            // Fulltext search\\n            CALL db.index.fulltext.queryNodes($fulltext_index, $query, {limit: $top_k})\\n            YIELD node, score\\n            WITH collect({node: node, score: score}) AS nodes, max(score) AS maxScore, min(score) AS minScore\\n            UNWIND nodes AS n\\n            RETURN n.node AS node,\\n                CASE    \\n                    WHEN maxScore = minScore THEN 1.0\\n                    ELSE (n.score - minScore) / (maxScore - minScore)\\n                END * (1.0 - $vector_weight) AS score\\n        }\\n        WITH node, sum(score) AS score\\n        ORDER BY score DESC\\n        LIMIT $top_k\\n\\n        \\n\\n        RETURN node.description AS description, node.name AS name, score\\n        '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Hybrid search - 10 resultados\n",
      "\n",
      "1. score=0.922\n",
      "\tmonkey: The monkey is a companion of Momotaro. He goes to the Ogres' Island with him.\n",
      "\n",
      "2. score=0.894\n",
      "\tdog: The dog is a companion of Momotaro. He breaks the bolts and bars with him.\n",
      "\n",
      "3. score=0.823\n",
      "\tMomotaro: Momotaro is the son of the old couple. He goes on a journey to get treasure from the Ogres' Island.\n",
      "\n",
      "4. score=0.495\n",
      "\tpheasant: The pheasant is a companion of Momotaro. He flies over the castle gate to peck the Ogres.\n",
      "\n",
      "5. score=0.433\n",
      "\togre: The ogres are the enemies of Momotaro and his companions. They are overthrown by them.\n",
      "\n",
      "6. score=0.205\n",
      "\told man: The old man is a kind and poor man who lives with his wife. He goes to the mountains to gather firewood.\n",
      "\n",
      "7. score=0.140\n",
      "\tcrow: A clever and resourceful bird who helps the bird catcher in his tasks and becomes a trusted advisor to the emperor.\n",
      "\n",
      "8. score=0.101\n",
      "\tthe tailor: A quarrelsome and abusive husband who beats his wife.\n",
      "\n",
      "9. score=0.072\n",
      "\tcock: A minor character who is heard crowing in the distance.\n",
      "\n",
      "10. score=0.069\n",
      "\tsultana: A beautiful young woman who is the object of the emperor's affections and later becomes his wife.\n",
      "\n"
     ]
    }
   ],
   "source": [
    "query = \"How did Momotaro convince the animals to join him on his journey?\"\n",
    "return_fields = {\n",
    "    \"description\": \"node.description\",\n",
    "    \"name\": \"node.name\"\n",
    "}\n",
    "retriever = HybridRetriever(neo4j, \"character_embeddings\", \"character_fulltext\", \"Character\", \"description\", vector_weight=0.5, return_projection=return_fields, include_score=True)\n",
    "results = retriever.retrieve(query, 10)\n",
    "\n",
    "print(f\"Hybrid search - {len(results)} resultados\\n\")\n",
    "for i, r in enumerate(results, 1):\n",
    "    print(f\"{i}. score={r[\"score\"]:.3f}\")\n",
    "    print(f\"\\t{r[\"name\"]}: {r[\"description\"]}\\n\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5b3bacab",
   "metadata": {},
   "outputs": [],
   "source": [
    "text2cypher = Text2CypherRetriever(neo4j)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "50838521",
   "metadata": {},
   "outputs": [],
   "source": [
    "rag = MultiAgentSystem(neo4j, verbose=True)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6d182cac",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "========== DECOMPOSED QUERIES ==========\n",
      "\n",
      "  ========== Query 1 ==========\n",
      "  Give me a character who has the role of helper and then describe them.\n",
      "\n",
      "========== ITERATION 1 ==========\n",
      "\n",
      "  ========== QUESTION 1 ==========\n",
      "  Question: Give me a character who has the role of helper and then describe them.\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> TOOL CALL ==========\n",
      "  [\n",
      "  {\n",
      "    \"name\": \"character_tool\",\n",
      "    \"args\": {\n",
      "      \"query\": \"Give me a character who has the role of helper and then describe them\"\n",
      "    },\n",
      "    \"id\": \"22c8a38b-02de-457a-8a18-0ba958578ad1\",\n",
      "    \"type\": \"tool_call\"\n",
      "  }\n",
      "]\n",
      "\n",
      "========== DECOMPOSED QUERIES ==========\n",
      "\n",
      "  ========== Query 1 ==========\n",
      "  Get all characters with the role 'helper'\n",
      "\n",
      "  ========== Query 2 ==========\n",
      "  Describe each character retrieved in step 1\n",
      "\n",
      "========== ITERATION 1 ==========\n",
      "\n",
      "  ========== QUESTION 1 ==========\n",
      "  Question: Get all characters with the role 'helper'\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> TOOL CALL ==========\n",
      "  [\n",
      "  {\n",
      "    \"name\": \"text2cypher\",\n",
      "    \"args\": {\n",
      "      \"query\": \"MATCH (c:Character)-[:HAS_ROLE]->(r) WHERE r.role = 'helper' RETURN c\"\n",
      "    },\n",
      "    \"id\": \"5ec7ac59-1157-4065-aa19-236832debbca\",\n",
      "    \"type\": \"tool_call\"\n",
      "  }\n",
      "]\n",
      "\n",
      "\n",
      "\n",
      "    ========== TOOL -> RESPONSE (text2cypher) ==========\n",
      "    [\n",
      "  {\n",
      "    \"type\": \"text\",\n",
      "    \"text\": \"{\\\"cypher\\\": \\\"MATCH (c:Character)-[:HAS_ROLE]->(r) WHERE r.name = 'helper' RETURN c\\\", \\\"context\\\": [\\\"{'c': {'race': 'monkey', 'gender': 'male', 'name': 'monkey', 'description': \\\\\\\"The monkey is a companion of Momotaro. He goes to the Ogres' Island with him.\\\\\\\", 'id': 'agent_52720da9976b4874a2fe6dbb8bfdf479', 'ageGroup': 'adult'}}\\\", \\\"{'c': {'race': 'pheasant', 'gender': 'male', 'name': 'pheasant', 'description': 'The pheasant is a companion of Momotaro. He flies over the castle gate to peck the Ogres.', 'id': 'agent_97cbe93fea7144648a281fe9c79728f6', 'ageGroup': 'adult'}}\\\", \\\"{'c': {'race': 'dog', 'gender': 'male', 'name': 'dog', 'description': 'The dog is a companion of Momotaro. He breaks the bolts and bars with him.', 'id': 'agent_768ca2150f5648478ab4f84c896fb04d', 'ageGroup': 'adult'}}\\\"]}\"\n",
      "  }\n",
      "]\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> FINAL ANSWER ==========\n",
      "  The characters with the role 'helper' are:\n",
      "\n",
      "1. Monkey\n",
      "2. Pheasant\n",
      "3. Dog\n",
      "\n",
      "  ========== CONTEXT ==========\n",
      "  [\n",
      "  \"{'c': {'race': 'monkey', 'gender': 'male', 'name': 'monkey', 'description': \\\"The monkey is a companion of Momotaro. He goes to the Ogres' Island with him.\\\", 'id': 'agent_52720da9976b4874a2fe6dbb8bfdf479', 'ageGroup': 'adult'}}\",\n",
      "  \"{'c': {'race': 'pheasant', 'gender': 'male', 'name': 'pheasant', 'description': 'The pheasant is a companion of Momotaro. He flies over the castle gate to peck the Ogres.', 'id': 'agent_97cbe93fea7144648a281fe9c79728f6', 'ageGroup': 'adult'}}\",\n",
      "  \"{'c': {'race': 'dog', 'gender': 'male', 'name': 'dog', 'description': 'The dog is a companion of Momotaro. He breaks the bolts and bars with him.', 'id': 'agent_768ca2150f5648478ab4f84c896fb04d', 'ageGroup': 'adult'}}\"\n",
      "]\n",
      "\n",
      "  ========== CRITIQUE ==========\n",
      "  {\n",
      "  \"is_complete\": true,\n",
      "  \"is_faithful\": true,\n",
      "  \"missing_info\": []\n",
      "}\n",
      "\n",
      "========== ITERATION 1 ==========\n",
      "\n",
      "  ========== QUESTION 2 ==========\n",
      "  Previous Q&A:\n",
      "- Question: Get all characters with the role 'helper'\n",
      "- Answer: The characters with the role 'helper' are:\n",
      "\n",
      "1. Monkey\n",
      "2. Pheasant\n",
      "3. Dog\n",
      "Question: Describe each character retrieved in step 1\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> TOOL CALL ==========\n",
      "  [\n",
      "  {\n",
      "    \"name\": \"vector_search\",\n",
      "    \"args\": {\n",
      "      \"query\": \"Describe monkey, pheasant and dog\"\n",
      "    },\n",
      "    \"id\": \"f7835ee2-b144-4556-9efd-2b244eccc254\",\n",
      "    \"type\": \"tool_call\"\n",
      "  }\n",
      "]\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. db.index.vector.queryNodes is deprecated. It is replaced by SEARCH.', position=<SummaryInputPosition line=2, column=9, offset=9>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 9, 'line': 2, 'column': 9}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        CALL db.index.vector.queryNodes($index_name, $top_k, $query_embedding)\\n        YIELD node, score\\n\\n        \\nOPTIONAL MATCH (node)-[:HAS_ROLE]->(r:Role)\\n\\n\\n        RETURN node.name AS name, node.description AS description, r.name AS role\\n        ORDER BY score DESC\\n        '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\n",
      "    ========== TOOL -> RESPONSE (vector_search) ==========\n",
      "    [\n",
      "  {\n",
      "    \"type\": \"text\",\n",
      "    \"text\": \"[\\\"name: pheasant\\\\ndescription: The pheasant is a companion of Momotaro. He flies over the castle gate to peck the Ogres.\\\\nrole: helper\\\"]\"\n",
      "  }\n",
      "]\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> FINAL ANSWER ==========\n",
      "  The characters with the role 'helper' are:\n",
      "\n",
      "1. Monkey\n",
      "   - Description: The monkey is a companion of Momotaro. He goes to the Ogres' Island with him.\n",
      "2. Pheasant\n",
      "   - Description: The pheasant is a companion of Momotaro. He flies over the castle gate to peck the Ogres.\n",
      "3. Dog\n",
      "   - Description: The dog is a companion of Momotaro. He breaks the bolts and bars with him.\n",
      "\n",
      "  ========== CONTEXT ==========\n",
      "  [\n",
      "  \"name: pheasant\\ndescription: The pheasant is a companion of Momotaro. He flies over the castle gate to peck the Ogres.\\nrole: helper\"\n",
      "]\n",
      "\n",
      "  ========== CRITIQUE ==========\n",
      "  {\n",
      "  \"is_complete\": true,\n",
      "  \"is_faithful\": true,\n",
      "  \"missing_info\": []\n",
      "}\n",
      "\n",
      "========== LOOP FINISHED ==========\n",
      "\n",
      "\n",
      "\n",
      "    ========== TOOL -> RESPONSE (character_tool) ==========\n",
      "    [\n",
      "  {\n",
      "    \"type\": \"text\",\n",
      "    \"text\": \"{\\\"answer\\\": \\\"The characters with the role 'helper' are:\\\\n\\\\n1. Monkey\\\\n   - Description: The monkey is a companion of Momotaro. He goes to the Ogres' Island with him.\\\\n2. Pheasant\\\\n   - Description: The pheasant is a companion of Momotaro. He flies over the castle gate to peck the Ogres.\\\\n3. Dog\\\\n   - Description: The dog is a companion of Momotaro. He breaks the bolts and bars with him.\\\", \\\"context\\\": [\\\"name: pheasant\\\\ndescription: The pheasant is a companion of Momotaro. He flies over the castle gate to peck the Ogres.\\\\nrole: helper\\\"]}\"\n",
      "  }\n",
      "]\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> FINAL ANSWER ==========\n",
      "  The characters with the role 'helper' are:\n",
      "\n",
      "1. Monkey\n",
      "   - Description: The monkey is a companion of Momotaro. He goes to the Ogres' Island with him.\n",
      "\n",
      "2. Pheasant\n",
      "   - Description: The pheasant is a companion of Momotaro. He flies over the castle gate to peck the Ogres.\n",
      "\n",
      "3. Dog\n",
      "   - Description: The dog is a companion of Momotaro. He breaks the bolts and bars with him.\n",
      "\n",
      "  ========== CONTEXT ==========\n",
      "  [\n",
      "  \"name: pheasant\\ndescription: The pheasant is a companion of Momotaro. He flies over the castle gate to peck the Ogres.\\nrole: helper\"\n",
      "]\n",
      "\n",
      "  ========== CRITIQUE ==========\n",
      "  {\n",
      "  \"is_complete\": true,\n",
      "  \"is_faithful\": true,\n",
      "  \"missing_info\": []\n",
      "}\n",
      "\n",
      "========== LOOP FINISHED ==========\n",
      "\n",
      "Question: Give me a character who has the role of helper and then describe them.\n",
      "Context: ['name: pheasant\\ndescription: The pheasant is a companion of Momotaro. He flies over the castle gate to peck the Ogres.\\nrole: helper']\n",
      "Answer: The characters with the role 'helper' are:\n",
      "\n",
      "1. Monkey\n",
      "   - Description: The monkey is a companion of Momotaro. He goes to the Ogres' Island with him.\n",
      "\n",
      "2. Pheasant\n",
      "   - Description: The pheasant is a companion of Momotaro. He flies over the castle gate to peck the Ogres.\n",
      "\n",
      "3. Dog\n",
      "   - Description: The dog is a companion of Momotaro. He breaks the bolts and bars with him.\n"
     ]
    }
   ],
   "source": [
    "result = rag.answer(\"Give me a character who has the role of helper and then describe them.\", \"test30\", max_iterations=1, decompose=False)\n",
    "\n",
    "print(\"\\nQuestion:\", result.question)\n",
    "if result.iterations:\n",
    "\tprint(\"Context:\", result.iterations[-1].context)\n",
    "print(\"Answer:\", result.answer)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "87f932cb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "========== DECOMPOSED QUERIES ==========\n",
      "\n",
      "  ========== Query 1 ==========\n",
      "  Which characters appear in the folktale 'The Thieves and the Cock'?\n",
      "\n",
      "========== ITERATION 1 ==========\n",
      "\n",
      "  ========== QUESTION 1 ==========\n",
      "  Question: Which characters appear in the folktale 'The Thieves and the Cock'?\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> TOOL CALL ==========\n",
      "  [\n",
      "  {\n",
      "    \"name\": \"character_tool\",\n",
      "    \"args\": {\n",
      "      \"query\": \"Which characters appear in the folktale ‘The Thieves and the Cock’\"\n",
      "    },\n",
      "    \"id\": \"1db7925b-a05e-4d62-8c4e-d88f304622ce\",\n",
      "    \"type\": \"tool_call\"\n",
      "  }\n",
      "]\n",
      "\n",
      "========== DECOMPOSED QUERIES ==========\n",
      "\n",
      "  ========== Query 1 ==========\n",
      "  Which characters appear in the folktale ‘The Thieves and the Cock’\n",
      "\n",
      "========== ITERATION 1 ==========\n",
      "\n",
      "  ========== QUESTION 1 ==========\n",
      "  Question: Which characters appear in the folktale ‘The Thieves and the Cock’\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> TOOL CALL ==========\n",
      "  [\n",
      "  {\n",
      "    \"name\": \"hybrid_search\",\n",
      "    \"args\": {\n",
      "      \"query\": \"characters in The Thieves and the Cock\"\n",
      "    },\n",
      "    \"id\": \"fd567a43-77fb-4f5a-9919-34b4dfde4bc4\",\n",
      "    \"type\": \"tool_call\"\n",
      "  }\n",
      "]\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. db.index.vector.queryNodes is deprecated. It is replaced by SEARCH.', position=<SummaryInputPosition line=4, column=13, offset=60>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 60, 'line': 4, 'column': 13}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        CALL () {\\n            // Vector search\\n            CALL db.index.vector.queryNodes($vector_index, $top_k, $query_embedding)\\n            YIELD node, score\\n            \\n            WITH collect({node: node, score: score}) AS nodes, max(score) AS maxScore, min(score) AS minScore\\n            UNWIND nodes AS n\\n            RETURN n.node AS node,\\n                CASE\\n                    WHEN maxScore = minScore THEN 1.0\\n                    ELSE (n.score - minScore) / (maxScore - minScore)\\n                END * $vector_weight AS score\\n\\n            UNION ALL\\n\\n            // Fulltext search\\n            CALL db.index.fulltext.queryNodes($fulltext_index, $query, {limit: $top_k})\\n            YIELD node, score\\n            WITH collect({node: node, score: score}) AS nodes, max(score) AS maxScore, min(score) AS minScore\\n            UNWIND nodes AS n\\n            RETURN n.node AS node,\\n                CASE    \\n                    WHEN maxScore = minScore THEN 1.0\\n                    ELSE (n.score - minScore) / (maxScore - minScore)\\n                END * (1.0 - $vector_weight) AS score\\n        }\\n        WITH node, sum(score) AS score\\n        ORDER BY score DESC\\n        LIMIT $top_k\\n\\n        \\nOPTIONAL MATCH (node)-[:HAS_ROLE]->(r:Role)\\n\\n\\n        RETURN node.name AS name, node.description AS description, r.name AS role\\n        '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\n",
      "    ========== TOOL -> RESPONSE (hybrid_search) ==========\n",
      "    [\n",
      "  {\n",
      "    \"type\": \"text\",\n",
      "    \"text\": \"[\\\"name: Thief\\\\ndescription: A person who broke into a house and stole the Cock.\\\\nrole: primary_character\\\"]\"\n",
      "  }\n",
      "]\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> FINAL ANSWER ==========\n",
      "  The characters that appear in the folktale 'The Thieves and the Cock' are:\n",
      "\n",
      "1. The Thief\n",
      "2. The Cock\n",
      "\n",
      "  ========== CONTEXT ==========\n",
      "  [\n",
      "  \"name: Thief\\ndescription: A person who broke into a house and stole the Cock.\\nrole: primary_character\"\n",
      "]\n",
      "\n",
      "  ========== CRITIQUE ==========\n",
      "  {\n",
      "  \"is_complete\": true,\n",
      "  \"is_faithful\": true,\n",
      "  \"missing_info\": []\n",
      "}\n",
      "\n",
      "========== LOOP FINISHED ==========\n",
      "\n",
      "\n",
      "\n",
      "    ========== TOOL -> RESPONSE (character_tool) ==========\n",
      "    [\n",
      "  {\n",
      "    \"type\": \"text\",\n",
      "    \"text\": \"{\\\"answer\\\": \\\"The characters that appear in the folktale 'The Thieves and the Cock' are:\\\\n\\\\n1. The Thief\\\\n2. The Cock\\\", \\\"context\\\": [\\\"name: Thief\\\\ndescription: A person who broke into a house and stole the Cock.\\\\nrole: primary_character\\\"]}\"\n",
      "  }\n",
      "]\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> FINAL ANSWER ==========\n",
      "  The characters that appear in the folktale 'The Thieves and the Cock' are:\n",
      "\n",
      "1. The Thief\n",
      "2. The Cock\n",
      "\n",
      "  ========== CONTEXT ==========\n",
      "  [\n",
      "  \"name: Thief\\ndescription: A person who broke into a house and stole the Cock.\\nrole: primary_character\"\n",
      "]\n",
      "\n",
      "  ========== CRITIQUE ==========\n",
      "  {\n",
      "  \"is_complete\": true,\n",
      "  \"is_faithful\": true,\n",
      "  \"missing_info\": []\n",
      "}\n",
      "\n",
      "========== LOOP FINISHED ==========\n",
      "\n",
      "Question: Which characters appear in the folktale 'The Thieves and the Cock'?\n",
      "Context: ['name: Thief\\ndescription: A person who broke into a house and stole the Cock.\\nrole: primary_character']\n",
      "Answer: The characters that appear in the folktale 'The Thieves and the Cock' are:\n",
      "\n",
      "1. The Thief\n",
      "2. The Cock\n"
     ]
    }
   ],
   "source": [
    "result = rag.answer(\"Which characters appear in the folktale 'The Thieves and the Cock'?\", \"test25\", max_iterations=1, decompose=False)\n",
    "\n",
    "print(\"\\nQuestion:\", result.question)\n",
    "if result.iterations:\n",
    "\tprint(\"Context:\", result.iterations[-1].context)\n",
    "print(\"Answer:\", result.answer)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "65d5d8bd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "========== DECOMPOSED QUERIES ==========\n",
      "\n",
      "  ========== Query 1 ==========\n",
      "  How many Character nodes are in the graph?\n",
      "\n",
      "========== ITERATION 1 ==========\n",
      "\n",
      "  ========== QUESTION 1 ==========\n",
      "  Question: How many Character nodes are in the graph?\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> TOOL CALL ==========\n",
      "  [\n",
      "  {\n",
      "    \"name\": \"folktale_tool\",\n",
      "    \"args\": {\n",
      "      \"query\": \"How many Character nodes are in the graph?\"\n",
      "    },\n",
      "    \"id\": \"cef9794a-b3d5-441f-a098-f986624a33ea\",\n",
      "    \"type\": \"tool_call\"\n",
      "  }\n",
      "]\n",
      "\n",
      "\n",
      "\n",
      "    ========== TOOL -> RESPONSE (folktale_tool) ==========\n",
      "    [\n",
      "  {\n",
      "    \"type\": \"text\",\n",
      "    \"text\": \"{\\\"cypher\\\": \\\"MATCH (n:Character) RETURN count(n)\\\", \\\"context\\\": [\\\"{'count(n)': 24}\\\"]}\"\n",
      "  }\n",
      "]\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> FINAL ANSWER ==========\n",
      "  There are 24 Character nodes in the graph.\n",
      "\n",
      "  ========== CONTEXT ==========\n",
      "  [\n",
      "  \"{'count(n)': 24}\"\n",
      "]\n",
      "\n",
      "  ========== CRITIQUE ==========\n",
      "  {\n",
      "  \"is_complete\": true,\n",
      "  \"is_faithful\": true,\n",
      "  \"missing_info\": []\n",
      "}\n",
      "\n",
      "========== LOOP FINISHED ==========\n",
      "\n",
      "Question: How many Character nodes are in the graph?\n",
      "Context: [\"{'count(n)': 24}\"]\n",
      "Answer: There are 24 Character nodes in the graph.\n"
     ]
    }
   ],
   "source": [
    "result = rag.answer(\"How many Character nodes are in the graph?\", \"duh\")\n",
    "\n",
    "print(\"\\nQuestion:\", result.question)\n",
    "if result.iterations:\n",
    "\tprint(\"Context:\", result.iterations[-1].context)\n",
    "print(\"Answer:\", result.answer)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "5ae7cdfe",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "========== DECOMPOSED QUERIES ==========\n",
      "\n",
      "  ========== Query 1 ==========\n",
      "  Who is matt?\n",
      "\n",
      "========== ITERATION 1 ==========\n",
      "\n",
      "  ========== QUESTION 1 ==========\n",
      "  Question: Who is matt?\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> TOOL CALL ==========\n",
      "  [\n",
      "  {\n",
      "    \"name\": \"character_tool\",\n",
      "    \"args\": {\n",
      "      \"query\": \"Who is matt?\"\n",
      "    },\n",
      "    \"id\": \"20453c5b-86ef-4f28-99fd-21eb2073cb0d\",\n",
      "    \"type\": \"tool_call\"\n",
      "  }\n",
      "]\n",
      "\n",
      "========== DECOMPOSED QUERIES ==========\n",
      "\n",
      "  ========== Query 1 ==========\n",
      "  Who is matt?\n",
      "\n",
      "========== ITERATION 1 ==========\n",
      "\n",
      "  ========== QUESTION 1 ==========\n",
      "  Question: Who is matt?\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> TOOL CALL ==========\n",
      "  [\n",
      "  {\n",
      "    \"name\": \"hybrid_search\",\n",
      "    \"args\": {\n",
      "      \"query\": \"Who is Matt?\"\n",
      "    },\n",
      "    \"id\": \"ed441246-8c9d-441d-94ef-f5820045b28a\",\n",
      "    \"type\": \"tool_call\"\n",
      "  }\n",
      "]\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. db.index.vector.queryNodes is deprecated. It is replaced by SEARCH.', position=<SummaryInputPosition line=4, column=13, offset=60>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 60, 'line': 4, 'column': 13}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        CALL () {\\n            // Vector search\\n            CALL db.index.vector.queryNodes($vector_index, $top_k, $query_embedding)\\n            YIELD node, score\\n            \\n            WITH collect({node: node, score: score}) AS nodes, max(score) AS maxScore, min(score) AS minScore\\n            UNWIND nodes AS n\\n            RETURN n.node AS node,\\n                CASE\\n                    WHEN maxScore = minScore THEN 1.0\\n                    ELSE (n.score - minScore) / (maxScore - minScore)\\n                END * $vector_weight AS score\\n\\n            UNION ALL\\n\\n            // Fulltext search\\n            CALL db.index.fulltext.queryNodes($fulltext_index, $query, {limit: $top_k})\\n            YIELD node, score\\n            WITH collect({node: node, score: score}) AS nodes, max(score) AS maxScore, min(score) AS minScore\\n            UNWIND nodes AS n\\n            RETURN n.node AS node,\\n                CASE    \\n                    WHEN maxScore = minScore THEN 1.0\\n                    ELSE (n.score - minScore) / (maxScore - minScore)\\n                END * (1.0 - $vector_weight) AS score\\n        }\\n        WITH node, sum(score) AS score\\n        ORDER BY score DESC\\n        LIMIT $top_k\\n\\n        \\nOPTIONAL MATCH (node)-[:HAS_ROLE]->(r:Role)\\n\\n\\n        RETURN node.name AS name, node.description AS description, r.name AS role\\n        '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\n",
      "    ========== TOOL -> RESPONSE (hybrid_search) ==========\n",
      "    [\n",
      "  {\n",
      "    \"type\": \"text\",\n",
      "    \"text\": \"[\\\"name: goat\\\\ndescription: A foolish and scatterbrained character who fails to impress the tiger.\\\\nrole: secondary_character\\\"]\"\n",
      "  }\n",
      "]\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> FINAL ANSWER ==========\n",
      "  Matt is a secondary character in the story, known as the goat. He is described as foolish and scatterbrained, failing to impress the tiger.\n",
      "\n",
      "  ========== CONTEXT ==========\n",
      "  [\n",
      "  \"name: goat\\ndescription: A foolish and scatterbrained character who fails to impress the tiger.\\nrole: secondary_character\"\n",
      "]\n",
      "\n",
      "  ========== CRITIQUE ==========\n",
      "  {\n",
      "  \"is_complete\": true,\n",
      "  \"is_faithful\": true,\n",
      "  \"missing_info\": []\n",
      "}\n",
      "\n",
      "========== LOOP FINISHED ==========\n",
      "\n",
      "\n",
      "\n",
      "    ========== TOOL -> RESPONSE (character_tool) ==========\n",
      "    [\n",
      "  {\n",
      "    \"type\": \"text\",\n",
      "    \"text\": \"{\\\"answer\\\": \\\"Matt is a secondary character in the story, known as the goat. He is described as foolish and scatterbrained, failing to impress the tiger.\\\", \\\"context\\\": [\\\"name: goat\\\\ndescription: A foolish and scatterbrained character who fails to impress the tiger.\\\\nrole: secondary_character\\\"]}\"\n",
      "  }\n",
      "]\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> FINAL ANSWER ==========\n",
      "  This information is not in the knowledge base.\n",
      "\n",
      "  ========== CONTEXT ==========\n",
      "  [\n",
      "  \"name: goat\\ndescription: A foolish and scatterbrained character who fails to impress the tiger.\\nrole: secondary_character\"\n",
      "]\n",
      "\n",
      "  ========== CRITIQUE ==========\n",
      "  {\n",
      "  \"is_complete\": false,\n",
      "  \"is_faithful\": true,\n",
      "  \"missing_info\": [\n",
      "    \"name of matt\"\n",
      "  ]\n",
      "}\n",
      "\n",
      "========== LOOP FINISHED ==========\n",
      "\n",
      "Question: Who is matt?\n",
      "Context: ['name: goat\\ndescription: A foolish and scatterbrained character who fails to impress the tiger.\\nrole: secondary_character']\n",
      "Answer: This information is not in the knowledge base.\n"
     ]
    }
   ],
   "source": [
    "result = rag.answer(\"Who is matt?\", \"matt\", max_iterations=1, decompose=False)\n",
    "\n",
    "print(\"\\nQuestion:\", result.question)\n",
    "if result.iterations:\n",
    "\tprint(\"Context:\", result.iterations[-1].context)\n",
    "print(\"Answer:\", result.answer)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9c02f8e8",
   "metadata": {},
   "outputs": [],
   "source": [
    "neo4j.close()\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "folktales-graph-rag",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
