{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "4cef4733",
   "metadata": {},
   "outputs": [],
   "source": [
    "from retrievers.vector_retriever import VectorRetriever\n",
    "from retrievers.fulltext_retriever import FullTextRetriever\n",
    "from retrievers.hybrid_retriever import HybridRetriever\n",
    "from retrievers.text2cyper import Text2CypherRetriever\n",
    "from neo4j_manager import Neo4jManager\n",
    "# from agents.agentic_rag import AgenticRAG\n",
    "from agents.multi_agent_system import MultiAgentSystem\n",
    "from agents.question_descomposer import QuestionDecomposer\n"
   ]
  },
  {
   "cell_type": "raw",
   "id": "c2217a0c",
   "metadata": {
    "vscode": {
     "languageId": "raw"
    }
   },
   "source": [
    "query = \"Name one main character, and tell me more about him.\"\n",
    "\n",
    "decomposer = QuestionDecomposer()\n",
    "decomposer.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "01e0cf9f",
   "metadata": {},
   "outputs": [],
   "source": [
    "neo4j = Neo4jManager()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "646f94d5",
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"Who is Momotaro?\"\n",
    "\n",
    "extra_match = \"\"\"\n",
    "OPTIONAL MATCH (node)-[:HAS_ROLE]->(r:Role)\n",
    "\"\"\"\n",
    "\n",
    "return_projection={\n",
    "\t\"name\": \"node.name\",\n",
    "\t\"description\": \"node.description\",\n",
    "\t\"role\": \"r.name\"\n",
    "}\n",
    "retriever = VectorRetriever(neo4j, \"agent_embeddings\", return_projection, extra_match)\n",
    "results = retriever.retrieve(query)\n",
    "\n",
    "print(f\"Vector search - {len(results)} resultados\\n\")\n",
    "for i, r in enumerate(results, 1):\n",
    "    print(f\"{i}. score={r[\"score\"]:.3f}\")\n",
    "    print(f\"\\t{r[\"name\"]} [{r[\"role\"]}]: {r[\"description\"]}\\n\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "30a85b7b",
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"millet dumpling\"\n",
    "return_fields = {\n",
    "    \"description\": \"node.description\",\n",
    "    \"name\": \"node.name\"\n",
    "}\n",
    "retriever = FullTextRetriever(neo4j, \"event_fulltext\", \"Event\", \"description\", return_fields)\n",
    "results = retriever.retrieve(query)\n",
    "\n",
    "print(f\"Fulltext search - {len(results)} resultados\\n\")\n",
    "for i, r in enumerate(results, 1):\n",
    "    print(f\"{i}. score={r[\"score\"]:.3f}\")\n",
    "    print(f\"\\t{r[\"name\"]}: {r[\"description\"]}\\n\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "61ba0d01",
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"How did Momotaro convince the animals to join him on his journey?\"\n",
    "return_fields = {\n",
    "    \"description\": \"node.description\",\n",
    "    \"name\": \"node.name\"\n",
    "}\n",
    "retriever = HybridRetriever(neo4j, \"agent_embeddings\", \"agent_fulltext\", \"Agent\", \"description\", vector_weight=0.5, return_projection=return_fields, include_score=True)\n",
    "results = retriever.retrieve(query, 10)\n",
    "\n",
    "print(f\"Hybrid search - {len(results)} resultados\\n\")\n",
    "for i, r in enumerate(results, 1):\n",
    "    print(f\"{i}. score={r[\"score\"]:.3f}\")\n",
    "    print(f\"\\t{r[\"name\"]}: {r[\"description\"]}\\n\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2a0e7629",
   "metadata": {},
   "outputs": [],
   "source": [
    "# What happens in Momotaro, in order, and which characters are involved in each event?\n",
    "cypher_query = \"\"\"\n",
    "MATCH (f:Folktale {url: $url})-[:HAS_EVENT]->(e:Event)\n",
    "OPTIONAL MATCH (e)-[:HAS_AGENT]->(a:Agent)\n",
    "RETURN e.order AS order,\n",
    "       e.name AS event,\n",
    "       collect(a.name) AS agents\n",
    "ORDER BY order\n",
    "\"\"\"\n",
    "\n",
    "params = {\n",
    "    \"url\": \"https://fairytalez.com/momotaro/\"\n",
    "}\n",
    "\n",
    "results = neo4j.execute_query(cypher_query, params)\n",
    "\n",
    "for idx, row in enumerate(results):\n",
    "    print(f\"- {idx}. {row[\"event\"]}: {row[\"agents\"]}\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5f2ffcb8",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Which characters are most important in the story based on how many events they appear in?\n",
    "cypher_query = \"\"\"\n",
    "MATCH (a:Agent)\n",
    "OPTIONAL MATCH (a)<-[:HAS_AGENT]-(e:Event)\n",
    "RETURN a.name AS agent,\n",
    "       count(DISTINCT e) AS event_count\n",
    "ORDER BY event_count DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "results = neo4j.execute_query(cypher_query)\n",
    "\n",
    "for idx, row in enumerate(results):\n",
    "    print(f\"- {row[\"agent\"]}: {row[\"event_count\"]}\")\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "884dfc9c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# What happens after the specific event where Momotaro gives the dumpling to the dog?\n",
    "cypher_query = \"\"\"\n",
    "MATCH (e:Event {name: $name})-[:POST_EVENT]->(next:Event)\n",
    "RETURN e.name AS current_event,\n",
    "       next.name AS next_event\n",
    "\"\"\"\n",
    "\n",
    "params = {\n",
    "    \"name\": \"Momotaro gives dog a dumpling.\"\n",
    "}\n",
    "\n",
    "results = neo4j.execute_query(cypher_query, params)\n",
    "\n",
    "for row in results:\n",
    "    print(f\"- {row['current_event']} -> {row['next_event']}\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e4c04929",
   "metadata": {},
   "outputs": [],
   "source": [
    "# How many folktales come from Japan?\n",
    "cypher_query = \"\"\"\n",
    "MATCH (f:Folktale)-[:FROM_NATION]->(n:Nation {name: $name})\n",
    "RETURN count(f) AS total_folktales\n",
    "\"\"\"\n",
    "\n",
    "params = {\n",
    "    \"name\": \"japanese\"\n",
    "}\n",
    "\n",
    "results = neo4j.execute_query(cypher_query, params)\n",
    "\n",
    "for row in results:\n",
    "    print(row[\"total_folktales\"])\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "61dfdd2c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Who are Momotaro's friends?\n",
    "cypher_query = \"\"\"\n",
    "MATCH (m:Agent {name: $name})-[r:RELATIONSHIP]->(a:Agent)\n",
    "WHERE r.type = \"friend\"\n",
    "RETURN a.name AS friend\n",
    "\"\"\"\n",
    "\n",
    "params = {\n",
    "    \"name\": \"Momotaro\"\n",
    "}\n",
    "\n",
    "results = neo4j.execute_query(cypher_query, params)\n",
    "\n",
    "for row in results:\n",
    "    print(row[\"friend\"])\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d27a29b7",
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (f:Folktale)\n",
    "RETURN f.title as title,\n",
    "       f.url as url\n",
    "\"\"\"\n",
    "\n",
    "results = neo4j.execute_query(cypher_query)\n",
    "\n",
    "for row in results:\n",
    "    print(row)\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5b3bacab",
   "metadata": {},
   "outputs": [],
   "source": [
    "text2cypher = Text2CypherRetriever(neo4j)\n",
    "\n",
    "text2cypher.add_few_shot_example(\n",
    "    \"What happens in Momotaro, in order, and which characters are involved in each event?\",\n",
    "    \"\"\"\n",
    "    MATCH (f:Folktale {url: \"https://fairytalez.com/momotaro/\"})-[:HAS_EVENT]->(e:Event)\n",
    "    OPTIONAL MATCH (e)-[:HAS_AGENT]->(a:Agent)\n",
    "    RETURN e.order AS order,\n",
    "           e.name AS event,\n",
    "           collect(a.name) AS agents\n",
    "    ORDER BY order\n",
    "    \"\"\"\n",
    ")\n",
    "\n",
    "text2cypher.add_few_shot_example(\n",
    "    \"Which characters are most important in the story based on how many events they appear in?\",\n",
    "    \"\"\"\n",
    "    MATCH (a:Agent)\n",
    "    OPTIONAL MATCH (a)<-[:HAS_AGENT]-(e:Event)\n",
    "    RETURN a.name AS agent,\n",
    "           count(DISTINCT e) AS event_count\n",
    "    ORDER BY event_count DESC\n",
    "    LIMIT 10\n",
    "    \"\"\"\n",
    ")\n",
    "\n",
    "text2cypher.add_few_shot_example(\n",
    "    \"How many folktales come from Japan?\",\n",
    "    \"\"\"\n",
    "    MATCH (f:Folktale)-[:FROM_NATION]->(n:Nation {name: \"Japan\"})\n",
    "    RETURN count(f) AS total_folktales\n",
    "    \"\"\"\n",
    ")\n",
    "\n",
    "text2cypher.add_few_shot_example(\n",
    "    \"Who are Momotaro's friends?\",\n",
    "    \"\"\"\n",
    "    MATCH (m:Agent {name: \"Momotaro\"})-[r:RELATIONSHIP]->(a:Agent)\n",
    "    WHERE r.type = \"friend\"\n",
    "    RETURN a.name AS friend\n",
    "    \"\"\"\n",
    ")\n",
    "\n",
    "text2cypher.add_few_shot_example(\n",
    "    \"What happens after the specific event where Momotaro gives the dumpling to the dog?\",\n",
    "    \"\"\"\n",
    "    MATCH (e:Event {name: \"Momotaro gives dog a dumpling.\"})-[:POST_EVENT]->(next:Event)\n",
    "    RETURN e.name AS current_event,\n",
    "           next.name AS next_event\n",
    "    \"\"\"\n",
    ")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "31d8a192",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Consulta de conteo sobre nodo de dominio real\n",
    "cypher, results = text2cypher.retrieve(\"How many Event nodes are in the graph?\")\n",
    "\n",
    "print(\"Cypher generado:\")\n",
    "print(f\"  {cypher}\\n\")\n",
    "print(\"Resultados:\")\n",
    "for r in results:\n",
    "    print(f\"  {r}\")\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "087f4648",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Traversal: qué instituciones aparecen en el grafo\n",
    "cypher, results = text2cypher.retrieve(\"How many characters have the role of helper?\")\n",
    "\n",
    "print(\"Cypher generado:\")\n",
    "print(f\"  {cypher}\\n\")\n",
    "print(\"Resultados:\")\n",
    "for r in results:\n",
    "    print(f\"  {r}\")\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "50838521",
   "metadata": {},
   "outputs": [],
   "source": [
    "rag = MultiAgentSystem(neo4j)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6d182cac",
   "metadata": {},
   "outputs": [],
   "source": [
    "# How did Momotaro convince the animals to join him on his journey?\n",
    "# How many Event nodes are in the graph?\"\n",
    "# How many characters have the role of helper?\n",
    "\n",
    "result = rag.answer(\"How did Momotaro convince the animals to join him on his journey?\", \"test1\")\n",
    "\n",
    "print(\"\\nQuestion:\", result.question)\n",
    "if result.iterations:\n",
    "\tprint(\"Context:\", result.iterations[-1].context)\n",
    "print(\"Answer:\", result.answer)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4657e781",
   "metadata": {},
   "outputs": [],
   "source": [
    "# How did Momotaro convince the animals to join him on his journey?\n",
    "# How many Event nodes are in the graph?\"\n",
    "# How many characters have the role of helper?\n",
    "\n",
    "result = rag.answer(\"How many characters have the role of helper?\", \"test4\")\n",
    "\n",
    "print(\"\\nQuestion:\", result.question)\n",
    "if result.iterations:\n",
    "\tprint(\"Context:\", result.iterations[-1].context)\n",
    "print(\"Answer:\", result.answer)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "87f932cb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "sub_questions=[] should_decompose=False\n",
      "['Where do the ogres live in the story of Momotaro?']\n",
      "\n",
      "========== ITERATION 1 ==========\n",
      "\n",
      "  ========== QUESTION 1 ==========\n",
      "  Question: Where do the ogres live in the story of Momotaro?\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> TOOL CALL ==========\n",
      "  [\n",
      "  {\n",
      "    \"name\": \"place_tool\",\n",
      "    \"args\": {\n",
      "      \"query\": \"Where do the ogres live in the story of Momotaro?\"\n",
      "    },\n",
      "    \"id\": \"c0a26833-6f4e-4939-9d4f-9af6c97cae28\",\n",
      "    \"type\": \"tool_call\"\n",
      "  }\n",
      "]\n",
      "sub_questions=[] should_decompose=False\n",
      "['Where do the ogres live in the story of Momotaro?']\n",
      "\n",
      "========== ITERATION 1 ==========\n",
      "\n",
      "  ========== QUESTION 1 ==========\n",
      "  Question: Where do the ogres live in the story of Momotaro?\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> TOOL CALL ==========\n",
      "  [\n",
      "  {\n",
      "    \"name\": \"hybrid_search\",\n",
      "    \"args\": {\n",
      "      \"query\": \"Where do the ogres live in the story of Momotaro?\"\n",
      "    },\n",
      "    \"id\": \"e938b3ae-9894-4d8e-a65d-5b89dde1aeab\",\n",
      "    \"type\": \"tool_call\"\n",
      "  }\n",
      "]\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. db.index.vector.queryNodes is deprecated. It is replaced by SEARCH.', position=<SummaryInputPosition line=4, column=13, offset=60>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 60, 'line': 4, 'column': 13}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        CALL () {\\n            // Vector search\\n            CALL db.index.vector.queryNodes($vector_index, $top_k, $query_embedding)\\n            YIELD node, score\\n            \\n            WITH collect({node: node, score: score}) AS nodes, max(score) AS maxScore, min(score) AS minScore\\n            UNWIND nodes AS n\\n            RETURN n.node AS node,\\n                CASE\\n                    WHEN maxScore = minScore THEN 1.0\\n                    ELSE (n.score - minScore) / (maxScore - minScore)\\n                END * $vector_weight AS score\\n\\n            UNION ALL\\n\\n            // Fulltext search\\n            CALL db.index.fulltext.queryNodes($fulltext_index, $query, {limit: $top_k})\\n            YIELD node, score\\n            WITH collect({node: node, score: score}) AS nodes, max(score) AS maxScore, min(score) AS minScore\\n            UNWIND nodes AS n\\n            RETURN n.node AS node,\\n                CASE    \\n                    WHEN maxScore = minScore THEN 1.0\\n                    ELSE (n.score - minScore) / (maxScore - minScore)\\n                END * (1.0 - $vector_weight) AS score\\n        }\\n        WITH node, sum(score) AS score\\n        ORDER BY score DESC\\n        LIMIT $top_k\\n\\n        \\n\\n        RETURN node.name AS name, node.description AS description, node.type AS type\\n        '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "hybrid_search\n",
      "{'vector_search': StructuredTool(name='vector_search', description='Use it for semantic search over folktale knowledge when the user asks open-ended, conceptual or descriptive questions. Ideal for themes, meanings, summaries, story interpretation, narrative elements or sysbolism.This tool performs pure vector similarity search and returns the most relevant text passages ranked by semantic relevance.', args_schema=<class 'agents.rag_tool_factory.QueryInput'>, func=<bound method RAGToolFactory._vector_search of <agents.rag_tool_factory.RAGToolFactory object at 0x0000023ABB8F9A60>>), 'hybrid_search': StructuredTool(name='hybrid_search', description='Use when the query contains BOTH semantic intent and explicit signals such as named folktales, characters, places, cultures objects, or partial keywords. Best for mixed queries that require combining keyword matching with semantic retrieval, such as specific story searches with context or partial information. Returns relevant passages using a combination of vector similarity and keyword filtering.', args_schema=<class 'agents.rag_tool_factory.QueryInput'>, func=<bound method RAGToolFactory._hybrid_search of <agents.rag_tool_factory.RAGToolFactory object at 0x0000023ABB8F9A60>>), 'text2cypher': StructuredTool(name='text2cypher', description='Use for structured queries that require structural information about the graph. This includes questions about relationships between entities, counts, filtering, comparisons, rankings, graph traversal, paths between nodes, temporal or event ordering and queries at the type level (e.g., categories or entity classes). Returns both the generated Cypher query and structured graph results.', args_schema=<class 'agents.rag_tool_factory.QueryInput'>, func=<bound method RAGToolFactory._text2cypher of <agents.rag_tool_factory.RAGToolFactory object at 0x0000023ABB8F9A60>>)}\n",
      "None\n",
      "\n",
      "\n",
      "\n",
      "    ========== TOOL -> RESPONSE (hybrid_search) ==========\n",
      "    [\n",
      "  {\n",
      "    \"type\": \"text\",\n",
      "    \"text\": \"[\\\"name: the Ogres' Island castle\\\\ndescription: a fortified residence where Momotaro fought the Ogres\\\\ntype: castle\\\", \\\"name: their village\\\\ndescription: where Momotaro lived with his adoptive parents\\\\ntype: village\\\"]\"\n",
      "  }\n",
      "]\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> FINAL ANSWER ==========\n",
      "  The ogres live on the Ogres' Island castle and in their village.\n",
      "\n",
      "  ========== CONTEXT ==========\n",
      "  [\n",
      "  \"name: the Ogres' Island castle\\ndescription: a fortified residence where Momotaro fought the Ogres\\ntype: castle\",\n",
      "  \"name: their village\\ndescription: where Momotaro lived with his adoptive parents\\ntype: village\"\n",
      "]\n",
      "\n",
      "  ========== CRITIQUE ==========\n",
      "  {\n",
      "  \"is_complete\": true,\n",
      "  \"is_faithful\": false,\n",
      "  \"missing_info\": [\n",
      "    \"specifically, which part of the island is the castle located\"\n",
      "  ]\n",
      "}\n",
      "\n",
      "========== ITERATION 2 ==========\n",
      "\n",
      "  ========== QUESTION 1 ==========\n",
      "  Question: Where do the ogres live in the story of Momotaro?\n",
      "Missing info:\n",
      "- specifically, which part of the island is the castle located\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> TOOL CALL ==========\n",
      "  [\n",
      "  {\n",
      "    \"name\": \"hybrid_search\",\n",
      "    \"args\": {\n",
      "      \"query\": \"Where do the ogres live in the story of Momotaro? Specifically, where is their castle located on Ogres' Island?\"\n",
      "    },\n",
      "    \"id\": \"5c5f61e8-b6f0-4d52-afc2-c82d7e740796\",\n",
      "    \"type\": \"tool_call\"\n",
      "  }\n",
      "]\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. db.index.vector.queryNodes is deprecated. It is replaced by SEARCH.', position=<SummaryInputPosition line=4, column=13, offset=60>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 60, 'line': 4, 'column': 13}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        CALL () {\\n            // Vector search\\n            CALL db.index.vector.queryNodes($vector_index, $top_k, $query_embedding)\\n            YIELD node, score\\n            \\n            WITH collect({node: node, score: score}) AS nodes, max(score) AS maxScore, min(score) AS minScore\\n            UNWIND nodes AS n\\n            RETURN n.node AS node,\\n                CASE\\n                    WHEN maxScore = minScore THEN 1.0\\n                    ELSE (n.score - minScore) / (maxScore - minScore)\\n                END * $vector_weight AS score\\n\\n            UNION ALL\\n\\n            // Fulltext search\\n            CALL db.index.fulltext.queryNodes($fulltext_index, $query, {limit: $top_k})\\n            YIELD node, score\\n            WITH collect({node: node, score: score}) AS nodes, max(score) AS maxScore, min(score) AS minScore\\n            UNWIND nodes AS n\\n            RETURN n.node AS node,\\n                CASE    \\n                    WHEN maxScore = minScore THEN 1.0\\n                    ELSE (n.score - minScore) / (maxScore - minScore)\\n                END * (1.0 - $vector_weight) AS score\\n        }\\n        WITH node, sum(score) AS score\\n        ORDER BY score DESC\\n        LIMIT $top_k\\n\\n        \\n\\n        RETURN node.name AS name, node.description AS description, node.type AS type\\n        '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "hybrid_search\n",
      "{'vector_search': StructuredTool(name='vector_search', description='Use it for semantic search over folktale knowledge when the user asks open-ended, conceptual or descriptive questions. Ideal for themes, meanings, summaries, story interpretation, narrative elements or sysbolism.This tool performs pure vector similarity search and returns the most relevant text passages ranked by semantic relevance.', args_schema=<class 'agents.rag_tool_factory.QueryInput'>, func=<bound method RAGToolFactory._vector_search of <agents.rag_tool_factory.RAGToolFactory object at 0x0000023ABB8F9A60>>), 'hybrid_search': StructuredTool(name='hybrid_search', description='Use when the query contains BOTH semantic intent and explicit signals such as named folktales, characters, places, cultures objects, or partial keywords. Best for mixed queries that require combining keyword matching with semantic retrieval, such as specific story searches with context or partial information. Returns relevant passages using a combination of vector similarity and keyword filtering.', args_schema=<class 'agents.rag_tool_factory.QueryInput'>, func=<bound method RAGToolFactory._hybrid_search of <agents.rag_tool_factory.RAGToolFactory object at 0x0000023ABB8F9A60>>), 'text2cypher': StructuredTool(name='text2cypher', description='Use for structured queries that require structural information about the graph. This includes questions about relationships between entities, counts, filtering, comparisons, rankings, graph traversal, paths between nodes, temporal or event ordering and queries at the type level (e.g., categories or entity classes). Returns both the generated Cypher query and structured graph results.', args_schema=<class 'agents.rag_tool_factory.QueryInput'>, func=<bound method RAGToolFactory._text2cypher of <agents.rag_tool_factory.RAGToolFactory object at 0x0000023ABB8F9A60>>)}\n",
      "None\n",
      "\n",
      "\n",
      "\n",
      "    ========== TOOL -> RESPONSE (hybrid_search) ==========\n",
      "    [\n",
      "  {\n",
      "    \"type\": \"text\",\n",
      "    \"text\": \"[\\\"name: the Ogres' Island castle\\\\ndescription: a fortified residence where Momotaro fought the Ogres\\\\ntype: castle\\\", \\\"name: their village\\\\ndescription: where Momotaro lived with his adoptive parents\\\\ntype: village\\\"]\"\n",
      "  }\n",
      "]\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> FINAL ANSWER ==========\n",
      "  The ogres live on the Ogres' Island, specifically in their village and at the Ogres' Island castle.\n",
      "\n",
      "  ========== CONTEXT ==========\n",
      "  [\n",
      "  \"name: the Ogres' Island castle\\ndescription: a fortified residence where Momotaro fought the Ogres\\ntype: castle\",\n",
      "  \"name: their village\\ndescription: where Momotaro lived with his adoptive parents\\ntype: village\"\n",
      "]\n",
      "\n",
      "  ========== CRITIQUE ==========\n",
      "  {\n",
      "  \"is_complete\": true,\n",
      "  \"is_faithful\": false,\n",
      "  \"missing_info\": [\n",
      "    \"specifically, which part of the island is the castle located\"\n",
      "  ]\n",
      "}\n",
      "\n",
      "========== LOOP FINISHED ==========\n",
      "place_tool\n",
      "{'greeting': StructuredTool(name='greeting', description='Handle conversational messages like greetings, farewells, thanks or capability questions.', args_schema=<class 'agents.terminal_tool_factory.EmptyInput'>, return_direct=True, metadata={'terminal': True}, func=<bound method TerminalToolFactory._greeting of <agents.terminal_tool_factory.TerminalToolFactory object at 0x0000023ABC06B5C0>>), 'out_of_scope': StructuredTool(name='out_of_scope', description='Handle questions unrelated to folktales.', args_schema=<class 'agents.terminal_tool_factory.EmptyInput'>, return_direct=True, metadata={'terminal': True}, func=<bound method TerminalToolFactory._out_of_scope of <agents.terminal_tool_factory.TerminalToolFactory object at 0x0000023ABC06B5C0>>), 'skills': StructuredTool(name='skills', description='Explain system capabilities.', args_schema=<class 'agents.terminal_tool_factory.EmptyInput'>, return_direct=True, metadata={'terminal': True}, func=<bound method TerminalToolFactory._skills of <agents.terminal_tool_factory.TerminalToolFactory object at 0x0000023ABC06B5C0>>), 'event_tool': StructuredTool(name='event_tool', description='Use it for questions about EVENTS in a story.\\n\\nExamples:\\n- What happens after the kind dies?\\n- What starts the conflict?\\n- Describe the final battle.\\n- Waht events lead to the ending?\\n- Whas is the sequence of events?', args_schema=<class 'agents.agentic_rag.RAGToolInput'>, metadata={'terminal': False}, func=<function AgenticRAG.as_tool.<locals>._run at 0x0000023ABA6F6AC0>), 'character_tool': StructuredTool(name='character_tool', description='Use it for questions about CHARACTERS in a story.\\n\\nExamples:\\n- Who is the protagonists?\\n- Who helps the hero?\\n- Describe the villain.\\n- What is the relationship between the king and the prince?\\n- Who betrayed the queen?', args_schema=<class 'agents.agentic_rag.RAGToolInput'>, metadata={'terminal': False}, func=<function AgenticRAG.as_tool.<locals>._run at 0x0000023ABA6F67A0>), 'place_tool': StructuredTool(name='place_tool', description='Use it for questions about PLACES in a story.\\n\\nExamples:\\n- Where does the battle occur?\\n- Where does the hero live?\\n- Describe the enchanted forest.\\n- Waht locations are important in the story?\\n- Where is the treasure hidden?', args_schema=<class 'agents.agentic_rag.RAGToolInput'>, metadata={'terminal': False}, func=<function AgenticRAG.as_tool.<locals>._run at 0x0000023ABA6F6840>), 'object_tool': StructuredTool(name='object_tool', description='Use it for questions about OBJECTS in a story.\\n\\nExamples:\\n- What magical items exist?\\n- Who owsn the sword?\\n- What is the significance of the ring?\\n- How is the key used?\\n- What objects are important for a specific story?', args_schema=<class 'agents.agentic_rag.RAGToolInput'>, metadata={'terminal': False}, func=<function AgenticRAG.as_tool.<locals>._run at 0x0000023ABA6F77E0>)}\n",
      "{'terminal': False}\n",
      "\n",
      "\n",
      "\n",
      "    ========== TOOL -> RESPONSE (place_tool) ==========\n",
      "    [\n",
      "  {\n",
      "    \"type\": \"text\",\n",
      "    \"text\": \"{\\\"answer\\\": \\\"The ogres live on the Ogres' Island, specifically in their village and at the Ogres' Island castle.\\\", \\\"context\\\": [\\\"name: the Ogres' Island castle\\\\ndescription: a fortified residence where Momotaro fought the Ogres\\\\ntype: castle\\\", \\\"name: their village\\\\ndescription: where Momotaro lived with his adoptive parents\\\\ntype: village\\\"]}\"\n",
      "  }\n",
      "]\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> FINAL ANSWER ==========\n",
      "  The ogres live on the Ogres' Island, specifically in their village and at the Ogres' Island castle.\n",
      "\n",
      "  ========== CONTEXT ==========\n",
      "  [\n",
      "  \"name: the Ogres' Island castle\\ndescription: a fortified residence where Momotaro fought the Ogres\\ntype: castle\",\n",
      "  \"name: their village\\ndescription: where Momotaro lived with his adoptive parents\\ntype: village\"\n",
      "]\n",
      "\n",
      "  ========== CRITIQUE ==========\n",
      "  {\n",
      "  \"is_complete\": true,\n",
      "  \"is_faithful\": false,\n",
      "  \"missing_info\": [\n",
      "    \"specifically\"\n",
      "  ]\n",
      "}\n",
      "\n",
      "========== ITERATION 2 ==========\n",
      "\n",
      "  ========== QUESTION 1 ==========\n",
      "  Question: Where do the ogres live in the story of Momotaro?\n",
      "Missing info:\n",
      "- specifically\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> TOOL CALL ==========\n",
      "  [\n",
      "  {\n",
      "    \"name\": \"place_tool\",\n",
      "    \"args\": {\n",
      "      \"query\": \"Where do the ogres live specifically in the story of Momotaro?\"\n",
      "    },\n",
      "    \"id\": \"6768e84a-a86f-4935-9262-96bc3260ebc4\",\n",
      "    \"type\": \"tool_call\"\n",
      "  }\n",
      "]\n",
      "sub_questions=['Where do the ogres live in the story of Momotaro?', 'What is the story of Momotaro?'] should_decompose=True\n",
      "['Where do the ogres live in the story of Momotaro?', 'What is the story of Momotaro?']\n",
      "\n",
      "========== ITERATION 1 ==========\n",
      "\n",
      "  ========== QUESTION 1 ==========\n",
      "  Question: Where do the ogres live in the story of Momotaro?\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> TOOL CALL ==========\n",
      "  [\n",
      "  {\n",
      "    \"name\": \"hybrid_search\",\n",
      "    \"args\": {\n",
      "      \"query\": \"Where do the ogres live in the story of Momotaro?\"\n",
      "    },\n",
      "    \"id\": \"9e3219f6-7f83-4a05-9683-87e0a6a199b9\",\n",
      "    \"type\": \"tool_call\"\n",
      "  }\n",
      "]\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. db.index.vector.queryNodes is deprecated. It is replaced by SEARCH.', position=<SummaryInputPosition line=4, column=13, offset=60>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 60, 'line': 4, 'column': 13}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        CALL () {\\n            // Vector search\\n            CALL db.index.vector.queryNodes($vector_index, $top_k, $query_embedding)\\n            YIELD node, score\\n            \\n            WITH collect({node: node, score: score}) AS nodes, max(score) AS maxScore, min(score) AS minScore\\n            UNWIND nodes AS n\\n            RETURN n.node AS node,\\n                CASE\\n                    WHEN maxScore = minScore THEN 1.0\\n                    ELSE (n.score - minScore) / (maxScore - minScore)\\n                END * $vector_weight AS score\\n\\n            UNION ALL\\n\\n            // Fulltext search\\n            CALL db.index.fulltext.queryNodes($fulltext_index, $query, {limit: $top_k})\\n            YIELD node, score\\n            WITH collect({node: node, score: score}) AS nodes, max(score) AS maxScore, min(score) AS minScore\\n            UNWIND nodes AS n\\n            RETURN n.node AS node,\\n                CASE    \\n                    WHEN maxScore = minScore THEN 1.0\\n                    ELSE (n.score - minScore) / (maxScore - minScore)\\n                END * (1.0 - $vector_weight) AS score\\n        }\\n        WITH node, sum(score) AS score\\n        ORDER BY score DESC\\n        LIMIT $top_k\\n\\n        \\n\\n        RETURN node.name AS name, node.description AS description, node.type AS type\\n        '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "hybrid_search\n",
      "{'vector_search': StructuredTool(name='vector_search', description='Use it for semantic search over folktale knowledge when the user asks open-ended, conceptual or descriptive questions. Ideal for themes, meanings, summaries, story interpretation, narrative elements or sysbolism.This tool performs pure vector similarity search and returns the most relevant text passages ranked by semantic relevance.', args_schema=<class 'agents.rag_tool_factory.QueryInput'>, func=<bound method RAGToolFactory._vector_search of <agents.rag_tool_factory.RAGToolFactory object at 0x0000023ABB8F9A60>>), 'hybrid_search': StructuredTool(name='hybrid_search', description='Use when the query contains BOTH semantic intent and explicit signals such as named folktales, characters, places, cultures objects, or partial keywords. Best for mixed queries that require combining keyword matching with semantic retrieval, such as specific story searches with context or partial information. Returns relevant passages using a combination of vector similarity and keyword filtering.', args_schema=<class 'agents.rag_tool_factory.QueryInput'>, func=<bound method RAGToolFactory._hybrid_search of <agents.rag_tool_factory.RAGToolFactory object at 0x0000023ABB8F9A60>>), 'text2cypher': StructuredTool(name='text2cypher', description='Use for structured queries that require structural information about the graph. This includes questions about relationships between entities, counts, filtering, comparisons, rankings, graph traversal, paths between nodes, temporal or event ordering and queries at the type level (e.g., categories or entity classes). Returns both the generated Cypher query and structured graph results.', args_schema=<class 'agents.rag_tool_factory.QueryInput'>, func=<bound method RAGToolFactory._text2cypher of <agents.rag_tool_factory.RAGToolFactory object at 0x0000023ABB8F9A60>>)}\n",
      "None\n",
      "\n",
      "\n",
      "\n",
      "    ========== TOOL -> RESPONSE (hybrid_search) ==========\n",
      "    [\n",
      "  {\n",
      "    \"type\": \"text\",\n",
      "    \"text\": \"[\\\"name: the Ogres' Island castle\\\\ndescription: a fortified residence where Momotaro fought the Ogres\\\\ntype: castle\\\", \\\"name: their village\\\\ndescription: where Momotaro lived with his adoptive parents\\\\ntype: village\\\"]\"\n",
      "  }\n",
      "]\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> FINAL ANSWER ==========\n",
      "  The ogres live on the Ogres' Island castle and in their village.\n",
      "\n",
      "  ========== CONTEXT ==========\n",
      "  [\n",
      "  \"name: the Ogres' Island castle\\ndescription: a fortified residence where Momotaro fought the Ogres\\ntype: castle\",\n",
      "  \"name: their village\\ndescription: where Momotaro lived with his adoptive parents\\ntype: village\"\n",
      "]\n",
      "\n",
      "  ========== CRITIQUE ==========\n",
      "  {\n",
      "  \"is_complete\": true,\n",
      "  \"is_faithful\": false,\n",
      "  \"missing_info\": [\n",
      "    \"specifically, which part of the island is the castle located\"\n",
      "  ]\n",
      "}\n",
      "\n",
      "========== ITERATION 2 ==========\n",
      "\n",
      "  ========== QUESTION 1 ==========\n",
      "  Question: Where do the ogres live in the story of Momotaro?\n",
      "Missing info:\n",
      "- specifically, which part of the island is the castle located\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> TOOL CALL ==========\n",
      "  [\n",
      "  {\n",
      "    \"name\": \"hybrid_search\",\n",
      "    \"args\": {\n",
      "      \"query\": \"Where do the ogres live in the story of Momotaro? Specifically, where is their castle located on Ogres' Island?\"\n",
      "    },\n",
      "    \"id\": \"0952a46c-9f17-481e-b62e-41878ef57335\",\n",
      "    \"type\": \"tool_call\"\n",
      "  }\n",
      "]\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. db.index.vector.queryNodes is deprecated. It is replaced by SEARCH.', position=<SummaryInputPosition line=4, column=13, offset=60>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 60, 'line': 4, 'column': 13}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        CALL () {\\n            // Vector search\\n            CALL db.index.vector.queryNodes($vector_index, $top_k, $query_embedding)\\n            YIELD node, score\\n            \\n            WITH collect({node: node, score: score}) AS nodes, max(score) AS maxScore, min(score) AS minScore\\n            UNWIND nodes AS n\\n            RETURN n.node AS node,\\n                CASE\\n                    WHEN maxScore = minScore THEN 1.0\\n                    ELSE (n.score - minScore) / (maxScore - minScore)\\n                END * $vector_weight AS score\\n\\n            UNION ALL\\n\\n            // Fulltext search\\n            CALL db.index.fulltext.queryNodes($fulltext_index, $query, {limit: $top_k})\\n            YIELD node, score\\n            WITH collect({node: node, score: score}) AS nodes, max(score) AS maxScore, min(score) AS minScore\\n            UNWIND nodes AS n\\n            RETURN n.node AS node,\\n                CASE    \\n                    WHEN maxScore = minScore THEN 1.0\\n                    ELSE (n.score - minScore) / (maxScore - minScore)\\n                END * (1.0 - $vector_weight) AS score\\n        }\\n        WITH node, sum(score) AS score\\n        ORDER BY score DESC\\n        LIMIT $top_k\\n\\n        \\n\\n        RETURN node.name AS name, node.description AS description, node.type AS type\\n        '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "hybrid_search\n",
      "{'vector_search': StructuredTool(name='vector_search', description='Use it for semantic search over folktale knowledge when the user asks open-ended, conceptual or descriptive questions. Ideal for themes, meanings, summaries, story interpretation, narrative elements or sysbolism.This tool performs pure vector similarity search and returns the most relevant text passages ranked by semantic relevance.', args_schema=<class 'agents.rag_tool_factory.QueryInput'>, func=<bound method RAGToolFactory._vector_search of <agents.rag_tool_factory.RAGToolFactory object at 0x0000023ABB8F9A60>>), 'hybrid_search': StructuredTool(name='hybrid_search', description='Use when the query contains BOTH semantic intent and explicit signals such as named folktales, characters, places, cultures objects, or partial keywords. Best for mixed queries that require combining keyword matching with semantic retrieval, such as specific story searches with context or partial information. Returns relevant passages using a combination of vector similarity and keyword filtering.', args_schema=<class 'agents.rag_tool_factory.QueryInput'>, func=<bound method RAGToolFactory._hybrid_search of <agents.rag_tool_factory.RAGToolFactory object at 0x0000023ABB8F9A60>>), 'text2cypher': StructuredTool(name='text2cypher', description='Use for structured queries that require structural information about the graph. This includes questions about relationships between entities, counts, filtering, comparisons, rankings, graph traversal, paths between nodes, temporal or event ordering and queries at the type level (e.g., categories or entity classes). Returns both the generated Cypher query and structured graph results.', args_schema=<class 'agents.rag_tool_factory.QueryInput'>, func=<bound method RAGToolFactory._text2cypher of <agents.rag_tool_factory.RAGToolFactory object at 0x0000023ABB8F9A60>>)}\n",
      "None\n",
      "\n",
      "\n",
      "\n",
      "    ========== TOOL -> RESPONSE (hybrid_search) ==========\n",
      "    [\n",
      "  {\n",
      "    \"type\": \"text\",\n",
      "    \"text\": \"[\\\"name: the Ogres' Island castle\\\\ndescription: a fortified residence where Momotaro fought the Ogres\\\\ntype: castle\\\", \\\"name: their village\\\\ndescription: where Momotaro lived with his adoptive parents\\\\ntype: village\\\"]\"\n",
      "  }\n",
      "]\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> FINAL ANSWER ==========\n",
      "  The ogres live on the Ogres' Island, specifically in their village and at the Ogres' Island castle.\n",
      "\n",
      "  ========== CONTEXT ==========\n",
      "  [\n",
      "  \"name: the Ogres' Island castle\\ndescription: a fortified residence where Momotaro fought the Ogres\\ntype: castle\",\n",
      "  \"name: their village\\ndescription: where Momotaro lived with his adoptive parents\\ntype: village\"\n",
      "]\n",
      "\n",
      "  ========== CRITIQUE ==========\n",
      "  {\n",
      "  \"is_complete\": true,\n",
      "  \"is_faithful\": false,\n",
      "  \"missing_info\": [\n",
      "    \"specifically, which part of the island is the castle located\"\n",
      "  ]\n",
      "}\n",
      "\n",
      "========== ITERATION 1 ==========\n",
      "\n",
      "  ========== QUESTION 2 ==========\n",
      "  Previous Q&A:\n",
      "- Question: Where do the ogres live in the story of Momotaro?\n",
      "- Answer: The ogres live on the Ogres' Island, specifically in their village and at the Ogres' Island castle.\n",
      "Question: What is the story of Momotaro?\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> TOOL CALL ==========\n",
      "  [\n",
      "  {\n",
      "    \"name\": \"vector_search\",\n",
      "    \"args\": {\n",
      "      \"query\": \"What is the story of Momotaro?\"\n",
      "    },\n",
      "    \"id\": \"7168414a-cfe3-4957-b174-c59428f3e8e5\",\n",
      "    \"type\": \"tool_call\"\n",
      "  }\n",
      "]\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. db.index.vector.queryNodes is deprecated. It is replaced by SEARCH.', position=<SummaryInputPosition line=2, column=9, offset=9>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 9, 'line': 2, 'column': 9}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        CALL db.index.vector.queryNodes($index_name, $top_k, $query_embedding)\\n        YIELD node, score\\n\\n        \\n\\n        RETURN node.name AS name, node.description AS description, node.type AS type\\n        ORDER BY score DESC\\n        '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "vector_search\n",
      "{'vector_search': StructuredTool(name='vector_search', description='Use it for semantic search over folktale knowledge when the user asks open-ended, conceptual or descriptive questions. Ideal for themes, meanings, summaries, story interpretation, narrative elements or sysbolism.This tool performs pure vector similarity search and returns the most relevant text passages ranked by semantic relevance.', args_schema=<class 'agents.rag_tool_factory.QueryInput'>, func=<bound method RAGToolFactory._vector_search of <agents.rag_tool_factory.RAGToolFactory object at 0x0000023ABB8F9A60>>), 'hybrid_search': StructuredTool(name='hybrid_search', description='Use when the query contains BOTH semantic intent and explicit signals such as named folktales, characters, places, cultures objects, or partial keywords. Best for mixed queries that require combining keyword matching with semantic retrieval, such as specific story searches with context or partial information. Returns relevant passages using a combination of vector similarity and keyword filtering.', args_schema=<class 'agents.rag_tool_factory.QueryInput'>, func=<bound method RAGToolFactory._hybrid_search of <agents.rag_tool_factory.RAGToolFactory object at 0x0000023ABB8F9A60>>), 'text2cypher': StructuredTool(name='text2cypher', description='Use for structured queries that require structural information about the graph. This includes questions about relationships between entities, counts, filtering, comparisons, rankings, graph traversal, paths between nodes, temporal or event ordering and queries at the type level (e.g., categories or entity classes). Returns both the generated Cypher query and structured graph results.', args_schema=<class 'agents.rag_tool_factory.QueryInput'>, func=<bound method RAGToolFactory._text2cypher of <agents.rag_tool_factory.RAGToolFactory object at 0x0000023ABB8F9A60>>)}\n",
      "None\n",
      "\n",
      "\n",
      "\n",
      "    ========== TOOL -> RESPONSE (vector_search) ==========\n",
      "    [\n",
      "  {\n",
      "    \"type\": \"text\",\n",
      "    \"text\": \"[\\\"name: their village\\\\ndescription: where Momotaro lived with his adoptive parents\\\\ntype: village\\\", \\\"name: the country-side\\\\ndescription: a medium-sized settlement larger than a village, where Momotaro was known\\\\ntype: town\\\"]\"\n",
      "  }\n",
      "]\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> FINAL ANSWER ==========\n",
      "  The story of Momotaro is about a young boy who lives in their village and later becomes known in the countryside.\n",
      "\n",
      "  ========== CONTEXT ==========\n",
      "  [\n",
      "  \"name: their village\\ndescription: where Momotaro lived with his adoptive parents\\ntype: village\",\n",
      "  \"name: the country-side\\ndescription: a medium-sized settlement larger than a village, where Momotaro was known\\ntype: town\"\n",
      "]\n",
      "\n",
      "  ========== CRITIQUE ==========\n",
      "  {\n",
      "  \"is_complete\": true,\n",
      "  \"is_faithful\": false,\n",
      "  \"missing_info\": [\n",
      "    \"description of the story\",\n",
      "    \"more details about the story's plot\"\n",
      "  ]\n",
      "}\n",
      "\n",
      "========== ITERATION 2 ==========\n",
      "\n",
      "  ========== QUESTION 2 ==========\n",
      "  Previous Q&A:\n",
      "- Question: Where do the ogres live in the story of Momotaro?\n",
      "- Answer: The ogres live on the Ogres' Island, specifically in their village and at the Ogres' Island castle.\n",
      "Question: What is the story of Momotaro?\n",
      "Missing info:\n",
      "- description of the story\n",
      "- more details about the story's plot\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> TOOL CALL ==========\n",
      "  [\n",
      "  {\n",
      "    \"name\": \"vector_search\",\n",
      "    \"args\": {\n",
      "      \"query\": \"What is the story of Momotaro? Describe its plot and provide more details.\"\n",
      "    },\n",
      "    \"id\": \"83e349cc-c2f6-4434-8452-4f84d3e00944\",\n",
      "    \"type\": \"tool_call\"\n",
      "  }\n",
      "]\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. db.index.vector.queryNodes is deprecated. It is replaced by SEARCH.', position=<SummaryInputPosition line=2, column=9, offset=9>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 9, 'line': 2, 'column': 9}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        CALL db.index.vector.queryNodes($index_name, $top_k, $query_embedding)\\n        YIELD node, score\\n\\n        \\n\\n        RETURN node.name AS name, node.description AS description, node.type AS type\\n        ORDER BY score DESC\\n        '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "vector_search\n",
      "{'vector_search': StructuredTool(name='vector_search', description='Use it for semantic search over folktale knowledge when the user asks open-ended, conceptual or descriptive questions. Ideal for themes, meanings, summaries, story interpretation, narrative elements or sysbolism.This tool performs pure vector similarity search and returns the most relevant text passages ranked by semantic relevance.', args_schema=<class 'agents.rag_tool_factory.QueryInput'>, func=<bound method RAGToolFactory._vector_search of <agents.rag_tool_factory.RAGToolFactory object at 0x0000023ABB8F9A60>>), 'hybrid_search': StructuredTool(name='hybrid_search', description='Use when the query contains BOTH semantic intent and explicit signals such as named folktales, characters, places, cultures objects, or partial keywords. Best for mixed queries that require combining keyword matching with semantic retrieval, such as specific story searches with context or partial information. Returns relevant passages using a combination of vector similarity and keyword filtering.', args_schema=<class 'agents.rag_tool_factory.QueryInput'>, func=<bound method RAGToolFactory._hybrid_search of <agents.rag_tool_factory.RAGToolFactory object at 0x0000023ABB8F9A60>>), 'text2cypher': StructuredTool(name='text2cypher', description='Use for structured queries that require structural information about the graph. This includes questions about relationships between entities, counts, filtering, comparisons, rankings, graph traversal, paths between nodes, temporal or event ordering and queries at the type level (e.g., categories or entity classes). Returns both the generated Cypher query and structured graph results.', args_schema=<class 'agents.rag_tool_factory.QueryInput'>, func=<bound method RAGToolFactory._text2cypher of <agents.rag_tool_factory.RAGToolFactory object at 0x0000023ABB8F9A60>>)}\n",
      "None\n",
      "\n",
      "\n",
      "\n",
      "    ========== TOOL -> RESPONSE (vector_search) ==========\n",
      "    [\n",
      "  {\n",
      "    \"type\": \"text\",\n",
      "    \"text\": \"[\\\"name: the country-side\\\\ndescription: a medium-sized settlement larger than a village, where Momotaro was known\\\\ntype: town\\\", \\\"name: their village\\\\ndescription: where Momotaro lived with his adoptive parents\\\\ntype: village\\\"]\"\n",
      "  }\n",
      "]\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> FINAL ANSWER ==========\n",
      "  The story of Momotaro is about a young boy who lives in their village and later becomes known in the countryside. He fights ogres on Ogres' Island, specifically in their village and at the Ogres' Island castle.\n",
      "\n",
      "  ========== CONTEXT ==========\n",
      "  [\n",
      "  \"name: the country-side\\ndescription: a medium-sized settlement larger than a village, where Momotaro was known\\ntype: town\",\n",
      "  \"name: their village\\ndescription: where Momotaro lived with his adoptive parents\\ntype: village\"\n",
      "]\n",
      "\n",
      "  ========== CRITIQUE ==========\n",
      "  {\n",
      "  \"is_complete\": false,\n",
      "  \"is_faithful\": true,\n",
      "  \"missing_info\": [\n",
      "    \"description of the story\",\n",
      "    \"more details about the story's plot\"\n",
      "  ]\n",
      "}\n",
      "\n",
      "========== LOOP FINISHED ==========\n",
      "place_tool\n",
      "{'greeting': StructuredTool(name='greeting', description='Handle conversational messages like greetings, farewells, thanks or capability questions.', args_schema=<class 'agents.terminal_tool_factory.EmptyInput'>, return_direct=True, metadata={'terminal': True}, func=<bound method TerminalToolFactory._greeting of <agents.terminal_tool_factory.TerminalToolFactory object at 0x0000023ABC06B5C0>>), 'out_of_scope': StructuredTool(name='out_of_scope', description='Handle questions unrelated to folktales.', args_schema=<class 'agents.terminal_tool_factory.EmptyInput'>, return_direct=True, metadata={'terminal': True}, func=<bound method TerminalToolFactory._out_of_scope of <agents.terminal_tool_factory.TerminalToolFactory object at 0x0000023ABC06B5C0>>), 'skills': StructuredTool(name='skills', description='Explain system capabilities.', args_schema=<class 'agents.terminal_tool_factory.EmptyInput'>, return_direct=True, metadata={'terminal': True}, func=<bound method TerminalToolFactory._skills of <agents.terminal_tool_factory.TerminalToolFactory object at 0x0000023ABC06B5C0>>), 'event_tool': StructuredTool(name='event_tool', description='Use it for questions about EVENTS in a story.\\n\\nExamples:\\n- What happens after the kind dies?\\n- What starts the conflict?\\n- Describe the final battle.\\n- Waht events lead to the ending?\\n- Whas is the sequence of events?', args_schema=<class 'agents.agentic_rag.RAGToolInput'>, metadata={'terminal': False}, func=<function AgenticRAG.as_tool.<locals>._run at 0x0000023ABA6F6AC0>), 'character_tool': StructuredTool(name='character_tool', description='Use it for questions about CHARACTERS in a story.\\n\\nExamples:\\n- Who is the protagonists?\\n- Who helps the hero?\\n- Describe the villain.\\n- What is the relationship between the king and the prince?\\n- Who betrayed the queen?', args_schema=<class 'agents.agentic_rag.RAGToolInput'>, metadata={'terminal': False}, func=<function AgenticRAG.as_tool.<locals>._run at 0x0000023ABA6F67A0>), 'place_tool': StructuredTool(name='place_tool', description='Use it for questions about PLACES in a story.\\n\\nExamples:\\n- Where does the battle occur?\\n- Where does the hero live?\\n- Describe the enchanted forest.\\n- Waht locations are important in the story?\\n- Where is the treasure hidden?', args_schema=<class 'agents.agentic_rag.RAGToolInput'>, metadata={'terminal': False}, func=<function AgenticRAG.as_tool.<locals>._run at 0x0000023ABA6F6840>), 'object_tool': StructuredTool(name='object_tool', description='Use it for questions about OBJECTS in a story.\\n\\nExamples:\\n- What magical items exist?\\n- Who owsn the sword?\\n- What is the significance of the ring?\\n- How is the key used?\\n- What objects are important for a specific story?', args_schema=<class 'agents.agentic_rag.RAGToolInput'>, metadata={'terminal': False}, func=<function AgenticRAG.as_tool.<locals>._run at 0x0000023ABA6F77E0>)}\n",
      "{'terminal': False}\n",
      "\n",
      "\n",
      "\n",
      "    ========== TOOL -> RESPONSE (place_tool) ==========\n",
      "    [\n",
      "  {\n",
      "    \"type\": \"text\",\n",
      "    \"text\": \"{\\\"answer\\\": \\\"The story of Momotaro is about a young boy who lives in their village and later becomes known in the countryside. He fights ogres on Ogres' Island, specifically in their village and at the Ogres' Island castle.\\\", \\\"context\\\": [\\\"name: the country-side\\\\ndescription: a medium-sized settlement larger than a village, where Momotaro was known\\\\ntype: town\\\", \\\"name: their village\\\\ndescription: where Momotaro lived with his adoptive parents\\\\ntype: village\\\"]}\"\n",
      "  }\n",
      "]\n",
      "\n",
      "\n",
      "\n",
      "  ========== AI -> FINAL ANSWER ==========\n",
      "  The ogres live in their village and at the Ogres' Island castle.\n",
      "\n",
      "  ========== CONTEXT ==========\n",
      "  [\n",
      "  \"name: the country-side\\ndescription: a medium-sized settlement larger than a village, where Momotaro was known\\ntype: town\",\n",
      "  \"name: their village\\ndescription: where Momotaro lived with his adoptive parents\\ntype: village\"\n",
      "]\n",
      "\n",
      "  ========== CRITIQUE ==========\n",
      "  {\n",
      "  \"is_complete\": false,\n",
      "  \"is_faithful\": true,\n",
      "  \"missing_info\": [\n",
      "    \"specifically\",\n",
      "    \"Ogres' Island\"\n",
      "  ]\n",
      "}\n",
      "\n",
      "========== LOOP FINISHED ==========\n",
      "\n",
      "Question: Where do the ogres live in the story of Momotaro?\n",
      "Context: ['name: the country-side\\ndescription: a medium-sized settlement larger than a village, where Momotaro was known\\ntype: town', 'name: their village\\ndescription: where Momotaro lived with his adoptive parents\\ntype: village']\n",
      "Answer: The ogres live in their village and at the Ogres' Island castle.\n"
     ]
    }
   ],
   "source": [
    "# In stories where there is a hero, what is the main test he must overcome?\n",
    "\n",
    "result = rag.answer(\"Where do the ogres live in the story of Momotaro?\", \"test\")\n",
    "\n",
    "print(\"\\nQuestion:\", result.question)\n",
    "if result.iterations:\n",
    "\tprint(\"Context:\", result.iterations[-1].context)\n",
    "print(\"Answer:\", result.answer)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "dd3ef22f",
   "metadata": {},
   "outputs": [],
   "source": [
    "result = rag.answer(\"Hi, my name is Matt\", \"holamatt\")\n",
    "\n",
    "print(\"\\nQuestion:\", result.question)\n",
    "if result.iterations:\n",
    "\tprint(\"Context:\", result.iterations[-1].context)\n",
    "print(\"Answer:\", result.answer)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "65d5d8bd",
   "metadata": {},
   "outputs": [],
   "source": [
    "result = rag.answer(\"What is the weather\", \"duh\")\n",
    "\n",
    "print(\"\\nQuestion:\", result.question)\n",
    "if result.iterations:\n",
    "\tprint(\"Context:\", result.iterations[-1].context)\n",
    "print(\"Answer:\", result.answer)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9c02f8e8",
   "metadata": {},
   "outputs": [],
   "source": [
    "neo4j.close()\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "folktales-graph-rag",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
